filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/nfclink/nfclinklib/Source/RFID/RFID.cpp
/*******************************************************************************
 * @file    RFID.cpp
 * @brief
 * @version V0.0.2
 * @date    05/28/2014
 *
 * THE SOURCE CODE AND ITS RELATED DOCUMENTATION IS PROVIDED "AS IS". KRONEGGER
 * GMBH MAKES NO OTHER WARRANTY OF ANY KIND, WHETHER EXPRESS, IMPLIED OR,
 * STATUTORY AND DISCLAIMS ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY,
 * SATISFACTORY QUALITY, NON INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
 *
 * THE SOURCE CODE AND DOCUMENTATION MAY INCLUDE ERRORS. KRONEGGER GMBH
 * RESERVES THE RIGHT TO INCORPORATE MODIFICATIONS TO THE SOURCE CODE IN LATER
 * REVISIONS OF IT, AND TO MAKE IMPROVEMENTS OR CHANGES IN THE DOCUMENTATION OR
 * THE PRODUCTS OR TECHNOLOGIES DESCRIBED THEREIN AT ANY TIME.
 *
 * KRONEGGER GMBH SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR CONSEQUENTIAL
 * DAMAGE OR LIABILITY ARISING FROM YOUR USE OF THE SOURCE CODE OR ANY
 * DOCUMENTATION, INCLUDING BUT NOT LIMITED TO, LOST REVENUES, DATA OR PROFITS,
 * DAMAGES OF ANY SPECIAL, INCIDENTAL OR CONSEQUENTIAL NATURE, PUNITIVE DAMAGES,
 * LOSS OF PROPERTY OR LOSS OF PROFITS ARISING OUT OF OR IN CONNECTION WITH THIS
 * AGREEMENT, OR BEING UNUSABLE, EVEN IF ADVISED OF THE POSSIBILITY OR
 * PROBABILITY OF SUCH DAMAGES AND WHETHER A CLAIM FOR SUCH DAMAGE IS BASED UPON
 * WARRANTY, CONTRACT, TORT, NEGLIGENCE OR OTHERWISE.
 *
 * (C)Copyright Kronegger GmbH 2012 All rights reserved
 ******************************************************************************/

//#define _MSP430F5438
#define _MSP430F5529

#include "RFID.h"
#include "hardware.h"
#include "SPI.h"
#include "API.h"
#include "tool.h"
#include "DebugPrint.h"
#include "buffer.h"
#include "msp430.h"
#include "NCI_API.h"
#include "MSP430_hardware.h"
#include "TRF7970A.h"

#define MAXGUARDTIME 5
#define HAL_LF_T3T_MAX          (byte)0x01

static byte selectedFrameType = 0xFF;
static byte selectedBaudrate = BAUDRATE_106;

static const indextype BuffSize = 256;
static Buffer<indextype, BuffSize> mailbox;

bool RFID::isRxMultiple = false;
bool RFID::isNFCActive = false;

byte RFID::current_frame_type = NO_TAG_MODE;
byte RFID::current_frame_param = 0;
byte RFID::bitFrame = 0;
byte RFID::stmReceiveMode = RCV_IDLE;

bool g_bNfcTargetEnable = false;

struct RFID::_AAC {
	byte sens_res[2];byte sel_res;byte prot_sel[2];byte Padding[8];byte sys_code[2];byte pupi[4];byte afi;byte crc_aid[2];byte number_apli;byte proto_info[4];byte lfT3tFlags[2];byte lfProtocolType;byte lfAdvFeat;byte lfConBitrF;
} RFID::AACconfig;

Array<10> RFID::nfcid1; //ISO/IEC 18092 11.2.1.26 NFCID1 contents and cascade levels
Array<8> RFID::nfcid2; //ISO/IEC 18092 11.2.2.4 NFCID2 contents

static word _PICCTimeout = 200; // TODO: Check if this is being used

#define NFC_FIFO_SIZE 		255

uint8_t g_ui8FifoBuffer[NFC_FIFO_SIZE];

t_sTRF797x_Bitrate g_sTargetSupportedBitrates;
t_sTRF797x_TargetMode g_sTargetSupportedTechnologies;
tTRF797x_Status g_sTrf7970Status;

volatile uint8_t g_ui8IrqFlag;

uint8_t g_ui8TargetId[10];
uint8_t g_ui8IdLength;
bool g_bNfcDepSupport;
bool g_bIsoDepSuport;

extern "C" void RF_WriteMailBox(unsigned char *data, unsigned char len) {
	mailbox.Write(data, len);
}

extern "C" uint8_t RF_getBitframe(void) {
	return RFID::bitFrame;
}

extern "C" void RF_anticollisionProcess(uint8_t * pui8SendBuf,
		uint8_t ui8Length) {
	RFID::anticollisionProcess(pui8SendBuf, ui8Length);
}

/**
 *<b>Call Interface</b>
 *<p>
 * Todo: add description
 *</p>
 *@param opcode contains the Command code
 *@param sendbuf contains the reveived data from host.
 *@param sendlen contains the length of revieved data from host
 *@param recbuf contains the sending data to the host.
 *@param reclen contains the length of sending data to the host
 *@return
 */word RFID::Call(word opcode, byte *sendbuf, word sendlen, byte *recbuf,
		word &reclen) {

	switch (opcode) {
	case RFID_INIT:
		Init(sendbuf, sendlen, recbuf, reclen);
		return OK;
	case RFID_VERSION:
		return version(sendbuf, sendlen, recbuf, reclen);
	case RFID_FRAMETYPE: {
		if (sendlen != 2) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		word ret = 0;
		ret = FrameType(sendbuf[0], sendbuf[1]);
		if (ret != OK) {
			reclen = 0;
			return ret;
		}
		/*if(reclen >= 1) {
		 reclen = 1;
		 recbuf[0]=param;
		 }*/
		return OK;
	}
	case RFID_TRANSCEIVE: {

		if ((sendlen == 0) && (reclen == 0)) {
			return GENERAL_ERROR;
		}

		if ((sendlen == 0) && (reclen != 0)) {
			return RFID::readMailbox(recbuf, reclen);
		} else {

			//			if (sendlen != 6) {
			//			DebugPrint::Write("\nsendbuf[%02x]: ", sendlen);
			//			DebugPrint::Hex(sendbuf, sendlen);
			//			}
			word ret = RFID::transceive(0, sendbuf, sendlen, recbuf, reclen);
			//DebugPrint::Write("\nBitCollsionPos: %02x \nrecbuf: ", BitCollision());
			//DebugPrint::Write("recbuf[%02x]: ", reclen);
			//DebugPrint::Hex(recbuf, reclen);

			if (ret == RF_FRAMING_ERROR)
				P6OUT = 0x00;

			return ret;

		}

	}
	case RFID_AUTHENTICATE:
		return UNKNOWN_COMMAND;

	case RFID_CONTROL:
		if (sendlen < 1) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		return RFID::control(sendbuf, sendlen, recbuf, reclen);
	case RFID_DISCOVERY:
		return modeDetection(recbuf, reclen);
	case RFID_RESET:
		return UNKNOWN_COMMAND;
	default:
		//printf("RFID: unknown command %x\n",opcode);
		reclen = 0;
		return UNKNOWN_COMMAND;
	}
}

/**
 *<b>Call</b>
 *<p>
 * Wrapper for RFID::Call
 *</p>
 *@param opcode contains the opcode to execute
 *@param s1 contains sendbuf[0].
 *@param s2 contains sendbuf[1]. If s2 is a word (higher byte is not 0x00) then s2 is sent as sendbuf[1] and sendbuf[2]
 *@return any errorcode from RFID::Call. If the call was OK and returned exactly one byte via recbuf, this byte is returned as lower byte.
 */word RFID::Call(word opcode, byte s1, word s2) {
	byte r[1] = { 0 };
	word rlen = 1;
	word ret;

	if (s2 & 0xFF00) {
		byte b[] = { s1, (s2 >> 8), (s2 & 0x00FF) };
		ret = Call(opcode, b, 3, r, rlen);
	} else {
		byte b[] = { s1, (byte) s2 };
		ret = Call(opcode, b, 2, r, rlen);
	}

	//if no error occured and one byte is received, return this byte as lower byte
	if (ret == OK && rlen == 1) {
		return r[0] & 0x00FF;
	} else {
		return ret;
	}
}

/**
 *<b>Call</b>
 *<p>
 * Wrapper for RFID::Call
 *</p>
 *@param opcode contains the opcode to execute
 *@param s1 contains the only parameter sent via sendbuf. sendlen will be 1.
 *@return any errorcode from RFID::Call. If the call was OK and returned exactly one byte via recbuf, this byte is returned as lower byte.
 */word RFID::Call(word opcode, byte s1) {
	word rlen = 1;
	byte r[1] = { 0 };
	word ret = Call(opcode, &s1, 1, r, rlen);

	//if no error occured and one byte is received, return this byte as lower byte
	if (ret == OK && rlen == 1) {
		return r[0] & 0x00FF;
	} else {
		return ret;
	}
}

