filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/nfclink/nfclinklib/Source/RFID/RFID.cpp
//Sets a parameter to the given value
// type			parameter
// value		value for the parameter
void RFID::Timing(byte type, word value) {
	switch (type) {
	case PCD_GUARD_TIME:
		//_PCDGuardTime = value;
		break;
	case PICC_TIMEOUT:
		_PICCTimeout = value;
		break;
	case TRANSMISSIONTIMEOUT:
		//_TransmissionTimeout = value;
		break;
	case RECEIVE_TIMEOUT:
		//_ReceiveTimeout = value;
		break;
	}
}

int RFID::run() {
	if ((g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE)) {
		TRF797x_irqHandler(0);
	}
	return OK;
}

void RFID::callbackInit(bool (*callback)()) {
	RFID::callbackFunction = callback;
}

/**
 *<b>Setup Frame</b>
 *@param isNFC_TargetMode is a flag which is only true when initialized as Target (active and passive)
 *@param isNFCActive is a flag which is only be used to for set registers for higher baudrates
 *@param isNFC_Passive_Target was used at the transceive switch methode. Isn't used anymore, left here for tests
 */
void RFID::SetupFrame(byte mode) {
	// TODO modify with new target/initiator setup functions
	isRxMultiple = false;
	isNFCActive = false; //Only set by NFC_INITIATOR_ACTIVE to set the baudrate register
	bitFrame = 0x00;
	stmReceiveMode = RCV_IDLE;
	t_sTRF797x_InitiatorMode eInitiatorMode;
	t_sTRF797x_Bitrate eBitrate;
	volatile t_sTRF797x_TargetMode eSupportedTargetModes;

	eInitiatorMode.ui8byte = 0x00;
	eBitrate.ui16word = 0x0000;
	eSupportedTargetModes.ui8byte = 0x00;

	switch (mode) {
	case ISO14443A_BYTEFRAME:
		eInitiatorMode.bits.bPassiveTypeA = 1;
		eBitrate.bits.b106kpbs = 1;
		selectedFrameType = ISO14443A_BYTEFRAME;
		selectedBaudrate = BAUDRATE_106;
		TRF797x_initiatorModeSetup(eInitiatorMode, eBitrate);
		break;
	case ISO14443B_BYTEFRAME:
		eInitiatorMode.bits.bPassiveTypeB = 1;
		eBitrate.bits.b106kpbs = 1;
		selectedFrameType = ISO14443B_BYTEFRAME;
		selectedBaudrate = BAUDRATE_106;
		TRF797x_initiatorModeSetup(eInitiatorMode, eBitrate);
		break;
	case ISO15693_BYTEFRAME:
		eInitiatorMode.bits.bPassive15693 = 1;
		eBitrate.bits.b26_48_kbps_1_out_4 = 1;
		selectedFrameType = ISO15693_BYTEFRAME;
		selectedBaudrate = BAUDRATE_26_48;
		TRF797x_initiatorModeSetup(eInitiatorMode, eBitrate);
		break;
	case FELICA_BYTEFRAME:
		eInitiatorMode.bits.bPassiveTypeF = 1;
		eBitrate.bits.b212kpbs = 1;
		selectedFrameType = FELICA_BYTEFRAME;
		selectedBaudrate = BAUDRATE_212;
		TRF797x_initiatorModeSetup(eInitiatorMode, eBitrate);
		break;
	case NFC_INITIATOR_ACTIVE:
		// TODO: Check if this parameter is called. Should not be called
		break;
	case NFC_TARGET_PASSIVE:
		// TODO: Check if this parameter is called. Should not be called
		break;
	case NFC_TARGET_ACTIVE:
		// TODO: Check if this parameter is called. Should not be called
		break;
	case LISTEN_A_PASSIVE:
		// Clear Supported Technologies & Bitrates
		g_sTargetSupportedTechnologies.ui8byte = 0x00;
		g_sTargetSupportedBitrates.ui16word = 0x0000;
		g_sTargetSupportedTechnologies.bits.bPassiveTypeA = 1;
		g_sTargetSupportedBitrates.bits.b106kpbs = 1;
//		selectedFrameType = LISTEN_A_PASSIVE;
//		selectedBaudrate = BAUDRATE_106;
		if (g_sTrf7970Status.eCurrentMode != TRF_TARGET_MODE) {
			TRF797x_setTargetSelect(false);
			TRF797x_targetModeSetup(g_sTargetSupportedTechnologies,
					g_sTargetSupportedBitrates);
		}
		mailbox.flush();
		break;
	case LISTEN_B_PASSIVE:
		// Clear Supported Technologies & Bitrates
		g_sTargetSupportedTechnologies.ui8byte = 0x00;
		g_sTargetSupportedBitrates.ui16word = 0x0000;
		g_sTargetSupportedTechnologies.bits.bPassiveTypeB = 1;
		g_sTargetSupportedBitrates.bits.b106kpbs = 1;
//		selectedFrameType = LISTEN_B_PASSIVE;
//		selectedBaudrate = BAUDRATE_106;
		if (g_sTrf7970Status.eCurrentMode != TRF_TARGET_MODE) {
			TRF797x_setTargetSelect(false);
			TRF797x_targetModeSetup(g_sTargetSupportedTechnologies,
					g_sTargetSupportedBitrates);
		}
		mailbox.flush();
		break;
	case LISTEN_AB_PASSIVE:
		// Clear Supported Technologies & Bitrates
		g_sTargetSupportedTechnologies.ui8byte = 0x00;
		g_sTargetSupportedBitrates.ui16word = 0x0000;
		g_sTargetSupportedTechnologies.bits.bPassiveTypeA = 1;
		g_sTargetSupportedTechnologies.bits.bPassiveTypeB = 1;
		g_sTargetSupportedBitrates.bits.b106kpbs = 1;
//		selectedFrameType = LISTEN_AB_PASSIVE;
		if (g_sTrf7970Status.eCurrentMode != TRF_TARGET_MODE) {
			TRF797x_setTargetSelect(false);
			TRF797x_targetModeSetup(g_sTargetSupportedTechnologies,
					g_sTargetSupportedBitrates);
		}
		mailbox.flush();
		break;
	case LISTEN_F_PASSIVE:
		// Clear Supported Technologies & Bitrates
		g_sTargetSupportedTechnologies.ui8byte = 0x00;
		g_sTargetSupportedBitrates.ui16word = 0x0000;
		g_sTargetSupportedTechnologies.bits.bPassiveTypeF = 1;
		g_sTargetSupportedBitrates.bits.b212kpbs = 1;
		g_sTargetSupportedBitrates.bits.b424kpbs = 1;
//		selectedFrameType = LISTEN_F_PASSIVE;
		if (g_sTrf7970Status.eCurrentMode != TRF_TARGET_MODE) {
			TRF797x_setTargetSelect(false);
			TRF797x_targetModeSetup(g_sTargetSupportedTechnologies,
					g_sTargetSupportedBitrates);
		}
		mailbox.flush();
		break;
	case LISTEN_AF_PASSIVE:
		// Clear Supported Technologies & Bitrates
		g_sTargetSupportedTechnologies.ui8byte = 0x00;
		g_sTargetSupportedBitrates.ui16word = 0x0000;
		g_sTargetSupportedTechnologies.bits.bPassiveTypeA = 1;
		g_sTargetSupportedTechnologies.bits.bPassiveTypeF = 1;
		g_sTargetSupportedBitrates.bits.b106kpbs = 1;
		g_sTargetSupportedBitrates.bits.b212kpbs = 1;
		g_sTargetSupportedBitrates.bits.b424kpbs = 1;
//		selectedFrameType = LISTEN_AF_PASSIVE;

		if (g_sTrf7970Status.eCurrentMode != TRF_TARGET_MODE) {
			TRF797x_setTargetSelect(false);
			TRF797x_targetModeSetup(g_sTargetSupportedTechnologies,
					g_sTargetSupportedBitrates);
		}
		mailbox.flush();
		break;
	case LISTEN_BF_PASSIVE:
		// Clear Supported Technologies & Bitrates
		g_sTargetSupportedTechnologies.ui8byte = 0x00;
		g_sTargetSupportedBitrates.ui16word = 0x0000;
		g_sTargetSupportedTechnologies.bits.bPassiveTypeB = 1;
		g_sTargetSupportedTechnologies.bits.bPassiveTypeF = 1;
		g_sTargetSupportedBitrates.bits.b106kpbs = 1;
		g_sTargetSupportedBitrates.bits.b212kpbs = 1;
		g_sTargetSupportedBitrates.bits.b424kpbs = 1;
//		selectedFrameType = LISTEN_BF_PASSIVE;
		if (g_sTrf7970Status.eCurrentMode != TRF_TARGET_MODE) {
			TRF797x_setTargetSelect(false);
			TRF797x_targetModeSetup(g_sTargetSupportedTechnologies,
					g_sTargetSupportedBitrates);
		}
		mailbox.flush();
		break;
	case LISTEN_ABF_PASSIVE:
		// Clear Supported Technologies & Bitrates
		g_sTargetSupportedTechnologies.ui8byte = 0x00;
		g_sTargetSupportedBitrates.ui16word = 0x0000;
		g_sTargetSupportedTechnologies.bits.bPassiveTypeA = 1;
		g_sTargetSupportedTechnologies.bits.bPassiveTypeB = 1;
		g_sTargetSupportedTechnologies.bits.bPassiveTypeF = 1;
		g_sTargetSupportedBitrates.bits.b106kpbs = 1;
		g_sTargetSupportedBitrates.bits.b212kpbs = 1;
		g_sTargetSupportedBitrates.bits.b424kpbs = 1;
//		selectedFrameType = LISTEN_ABF_PASSIVE;
		if (g_sTrf7970Status.eCurrentMode != TRF_TARGET_MODE) {
			TRF797x_setTargetSelect(false);
			TRF797x_targetModeSetup(g_sTargetSupportedTechnologies,
					g_sTargetSupportedBitrates);
		}
		mailbox.flush();
		break;
	case NO_TAG_MODE:
		TRF797x_idleMode();
		break;
	default:
		//DebugPrint::Write("\nUnknown Frametype");
		break;
	}

	return;
}

/**
 *<b>callback</b>
 *<p>
 * call function in NCI.cpp for protocol handling
 *</p>
 *@return returns TRUE or FALSE for aborting
 */
bool RFID::callback() {
	static Timer tCallback;

	if (tCallback.iselapsed()) {
		if (callbackFunction()) {
			return true;
		}
		tCallback.Start(100);
	}
	return false;
}

bool (*RFID::callbackFunction)() = &RFID::functionDummy;

void RFID::anticollisionProcess(byte *sendbuf, byte length) {
	byte ui8ResBuffer[40];
	byte ui8BufIdx = 0;
	byte ui8Command;

