filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/nfclink/nfclinklib/Source/RFID/RFID.cpp
	ui8Command = sendbuf[0];

	TRF797x_setTargetSelect(false);

	switch (ui8Command) {
	//
	// Type A Commands
	//

	//
	// Received a REQA / SENS_REQ or WUPA
	//
	case 0x26:
	case 0x52:

		if(g_sTargetSupportedTechnologies.bits.bPassiveTypeA == 1)
		{
			// Register 01h. ISO Control Register
			//
			// 106 kbps Tag Emulator 14443A mode
			//

			// BIT15:12 RFU
			// BIT11:8 Proprietary - 0x03
			// BIT7:6  NFCID Length - 00 - Single, 01 - Double, 11 - Triple
			// BIT5 RFU
			// BIT4:0 Bit frame anti-collision - Bit 1

			// Note: Otherwise we receive a 0x30 0x0C 0x01 from the reader
			ui8ResBuffer[ui8BufIdx++] = AACconfig.sens_res[0];
			ui8ResBuffer[ui8BufIdx++] = 0x00;
			TRF797x_writeFIFO(ui8ResBuffer, CRC_BIT_DISABLE, ui8BufIdx, 0);

			// Register 01h. ISO Control Register - Receive @ 106 kbps without CRC.
			TRF797x_writeSingle(0xA4, TRF79X0_ISO_CONTROL_REG);
		}

		break;

		//
		// Received a anticollision command # 1
		//
	case 0x93:

		if(g_sTargetSupportedTechnologies.bits.bPassiveTypeA == 1)
		{
			//
			// Cascade level 1
			//
			if (sendbuf[1] == 0x20) {
				//
				// Clear Buffer[5]
				//
				ui8ResBuffer[4] = 0x00;
				for (ui8BufIdx = 0; ui8BufIdx < 4; ui8BufIdx++) {
					ui8ResBuffer[ui8BufIdx] = nfcid1.data[ui8BufIdx];
					ui8ResBuffer[4] ^= nfcid1.data[ui8BufIdx];
				}
				TRF797x_writeFIFO(ui8ResBuffer, CRC_BIT_DISABLE, 5, 0);
			}
			//
			// PCD Selected the TRF7970 based on the UID
			//
			else if (sendbuf[1] == 0x70) {

				// BIT5 - UID Complete, PICC Compliant with ISO / IEC 14443-4
				ui8ResBuffer[ui8BufIdx++] = AACconfig.sel_res; // SAK
				//NFCSend(&buffer[0]); //Send complete UID (93 20) / SAK ( 93 70 + UID)
				TRF797x_writeFIFO(ui8ResBuffer, CRC_BIT_ENABLE, ui8BufIdx, 0);

				//
				// 106 kbps Tag Emulator 14443A mode
				//
				// Register 01h. ISO Control Register
				TRF797x_writeSingle(0x24, TRF79X0_ISO_CONTROL_REG);

				// Disable Anti-collision Frames for 14443A.
				TRF797x_writeSingle(0x02, TRF79X0_SPECIAL_FUNC_1_REG);

				selectedFrameType = ISO14443A_BYTEFRAME;
				selectedBaudrate = BAUDRATE_106;

				TRF797x_setTargetSelect(true);
			}
		}

		break;

	case 0x05:

		if(g_sTargetSupportedTechnologies.bits.bPassiveTypeB == 1)
		{
			// ATQB Packet
			ui8ResBuffer[ui8BufIdx++] = 0x50; // ATQB Start Byte
			// NFCID 3:0
			ui8ResBuffer[ui8BufIdx++] = AACconfig.pupi[0];
			ui8ResBuffer[ui8BufIdx++] = AACconfig.pupi[1];
			ui8ResBuffer[ui8BufIdx++] = AACconfig.pupi[2];
			ui8ResBuffer[ui8BufIdx++] = AACconfig.pupi[3];

			// Application Data Bytes
			ui8ResBuffer[ui8BufIdx++] = AACconfig.afi; // AFI - Public Telephony, GSM ... ( See ISO14443-3 Table 12 AFI Coding)
			ui8ResBuffer[ui8BufIdx++] = AACconfig.crc_aid[0]; // CRC_B
			ui8ResBuffer[ui8BufIdx++] = AACconfig.crc_aid[1]; // CRC_B
			// TODO TI
			ui8ResBuffer[ui8BufIdx++] = 0x01; // # of applications (1)
			//		ui8ResBuffer[ui8BufIdx++] = TargetAC_number_apli; // # of applications (1)

			// Protocol Info Bytes
			ui8ResBuffer[ui8BufIdx++] = 0x00; // Date Rate Capability ( Only Support 106 kbps)
			// Max Frame/Protocol type (128 bytes / PICC compliant to -4)
			ui8ResBuffer[ui8BufIdx++] = 0x81;
			// (FWI/ADC/FO) ( FWT = 77.3mSec, ADC = coded according to AFI, CID supported)
			ui8ResBuffer[ui8BufIdx++] = 0xD5;

			TRF797x_writeFIFO(ui8ResBuffer, CRC_BIT_ENABLE, ui8BufIdx, 0);

			selectedFrameType = ISO14443B_BYTEFRAME;
			selectedBaudrate = BAUDRATE_106;

			// Testing new driver
			TRF797x_setTargetSelect(true);
		}

		break;
		//
		// Receive ATTRIB Req
		//
	case 0x1D:

		if(g_sTargetSupportedTechnologies.bits.bPassiveTypeB == 1)
		{
			if (sendbuf[1] == AACconfig.pupi[0] && sendbuf[2] == AACconfig.pupi[1]
					&& sendbuf[3] == AACconfig.pupi[2]
					&& sendbuf[4] == AACconfig.pupi[3]) {
				// ATTRIB Response
				ui8ResBuffer[ui8BufIdx++] = 0x00; // Length
				TRF797x_writeFIFO(ui8ResBuffer, CRC_BIT_ENABLE, ui8BufIdx, 0);

				selectedFrameType = ISO14443B_BYTEFRAME;
				selectedBaudrate = BAUDRATE_106;

				// Testing new driver
				TRF797x_setTargetSelect(true);
			}
		}

		break;
		//
		// Receive SENF_F REQ
		//
	case 0x06:

		if(g_sTargetSupportedTechnologies.bits.bPassiveTypeF == 1)
		{
			if (sendbuf[1] == 0x00 && sendbuf[2] == 0xFF && sendbuf[3] == 0xFF
					&& (sendbuf[4] == 0x01 || sendbuf[4] == 0x00))
			{
				if (sendbuf[4] == 0x01) {
					ui8ResBuffer[ui8BufIdx++] = 0x14; 	//SensF_Res Length
				} else {
					ui8ResBuffer[ui8BufIdx++] = 0x12; 	//SensF_Res Length
				}
				ui8ResBuffer[ui8BufIdx++] = 0x01;	//SensF_RES_CMD
				ui8ResBuffer[ui8BufIdx++] = nfcid2.data[0];	//nfcid2.data		//NFC-DEP Prot.(P2P-Target)=01;TagType3 Platform=02
				ui8ResBuffer[ui8BufIdx++] = nfcid2.data[1];
				ui8ResBuffer[ui8BufIdx++] = nfcid2.data[2];
				ui8ResBuffer[ui8BufIdx++] = nfcid2.data[3];
				ui8ResBuffer[ui8BufIdx++] = nfcid2.data[4];
				ui8ResBuffer[ui8BufIdx++] = nfcid2.data[5];
				ui8ResBuffer[ui8BufIdx++] = nfcid2.data[6];
				ui8ResBuffer[ui8BufIdx++] = nfcid2.data[7];
				ui8ResBuffer[ui8BufIdx++] = 0xC0;
				ui8ResBuffer[ui8BufIdx++] = 0xC1;
				ui8ResBuffer[ui8BufIdx++] = 0xC2;	//PAD1
				ui8ResBuffer[ui8BufIdx++] = 0xC3;
				ui8ResBuffer[ui8BufIdx++] = 0xC4;
				ui8ResBuffer[ui8BufIdx++] = 0xC5;	//MRTI_Check
				ui8ResBuffer[ui8BufIdx++] = 0xC6;	//MRTI_Update
				ui8ResBuffer[ui8BufIdx++] = 0xC7;	//PAD2
				if (sendbuf[4] == 0x01) {
					ui8ResBuffer[ui8BufIdx++] = 0xFF;	//[RD]
					ui8ResBuffer[ui8BufIdx++] = 0xFF;
				}

				// Delay for slot 0
				waitus(2250);

				TRF797x_writeFIFO(ui8ResBuffer, CRC_BIT_ENABLE, ui8BufIdx, 0);

				TRF797x_setTargetSelect(true);

				selectedFrameType = FELICA_BYTEFRAME;
			}
		}

		break;
		//
		// Receive HALT A/B
		//
	case 0x50:
		// Reset FIFO with an extra dummy clock

		if (selectedFrameType == ISO14443A_BYTEFRAME) {

			ui8ResBuffer[ui8BufIdx++] = 0x06; //response to HLTA
		}
		if (selectedFrameType == ISO14443B_BYTEFRAME) {

			ui8ResBuffer[ui8BufIdx++] = 0x00; // response to HLTB
		}
		TRF797x_writeFIFO(ui8ResBuffer, CRC_BIT_ENABLE, ui8BufIdx, 0);
		break;
		//
		// Receive Deselect
		//
	case 0xC2:

		if(g_sTargetSupportedTechnologies.bits.bPassiveTypeA == 1
			|| g_sTargetSupportedTechnologies.bits.bPassiveTypeB == 1)
		{
			ui8ResBuffer[ui8BufIdx++] = 0xC2; // response to deselect
			TRF797x_writeFIFO(ui8ResBuffer, CRC_BIT_ENABLE, ui8BufIdx, 0);

