filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/nfclink/nfclinklib/Source/RFID/RFID.cpp
			TRF797x_setTargetSelect(false);
		}

		break;
	default:
		TRF797x_resetMode();
		break;
	}

}

bool RFID::functionDummy() {
	return false;
}

unsigned char RFID::BitCollision() {
	return 0xFF;
}

unsigned short RFID::Init(unsigned char* sendbuf, unsigned short sendlen,
		unsigned char* recbuf, unsigned short & reclen) {

	TRF797x_setup();

	//default initialization for the AAC()
	/* NFCForum TS Digital Protocol 1.0 */

	AACconfig.sens_res[0] = 0x04; //4.6.3 SENS_RES Response, Byte1
	AACconfig.sens_res[1] = 0x04; //Byte2
	AACconfig.sel_res = 0x40; //4.8.2 SEL_RES Response
	AACconfig.Padding[0] = 0xFF; //PAD0 = see NFC FORUM TS Digital Protocol 1.0; Padding is set with dummy values for testing Typ3 communication
	AACconfig.Padding[1] = 0xFF; //PAD0
	AACconfig.Padding[2] = 0xFF; //PAD1
	AACconfig.Padding[3] = 0xFF; //PAD1
	AACconfig.Padding[4] = 0xFF; //PAD1
	AACconfig.Padding[5] = 0xFF; //MRTIcheck
	AACconfig.Padding[6] = 0xFF; //MRTIupadate
	AACconfig.Padding[7] = 0xFF; //PAD2
	AACconfig.sys_code[0] = 0xFF; //HCI default 0x12
	AACconfig.sys_code[1] = 0xFF; //HCI default 0xFC
	AACconfig.afi = 0x00;

//	setSensRes(AACconfig.sens_res, 2);
//	setSelRes(AACconfig.sel_res);
//	setPadding(AACconfig.Padding, 8);
//	setSysCode(AACconfig.sys_code, 2);
//	setAFI(AACconfig.afi);

	nfcid1.data[0] = 0x08;
	nfcid1.data[1] = 0x12;
	nfcid1.data[2] = 0x34;
	nfcid1.data[3] = 0x56;
	nfcid1.len = 4;
//	setNfcid1(nfcid1.data, nfcid1.len);

	for (int i = 0; i < 6; i++) {
		nfcid1.data[i + 4] = 0x00;
	}

	nfcid2.data[0] = 0x02; // protocol Byte1
	nfcid2.data[1] = 0xFE; // protocol Byte2
	nfcid2.data[2] = 0x12;
	nfcid2.data[3] = 0x34;
	nfcid2.data[4] = 0x56;
	nfcid2.data[5] = 0x78;
	nfcid2.data[6] = 0x90;
	nfcid2.data[7] = 0xAB;
	nfcid2.len = 8;

//	setNfcid2(nfcid2.data, nfcid2.len);

	AACconfig.pupi[0] = 0x01;
	AACconfig.pupi[1] = 0x02;
	AACconfig.pupi[2] = 0x03;
	AACconfig.pupi[3] = 0x04;

//	setPupi_(AACconfig.pupi, 4);

	AACconfig.crc_aid[0] = 0x00;
	AACconfig.crc_aid[1] = 0x00;
	AACconfig.number_apli = 0x00;

//	setCRCAid(AACconfig.crc_aid, 2);
//	setNumberApli(AACconfig.number_apli);

	AACconfig.proto_info[0] = 0x00;
	AACconfig.proto_info[1] = 0x00;
	AACconfig.proto_info[2] = 0x45; //protocol info byte NCI default 0x45 (FWI 0x04) (ADC FO 0x05)
	AACconfig.proto_info[3] = 0x00;

//	setProtoInfo(AACconfig.proto_info, 4);

	return OK;
}

/**
 *<b>Version</b>
 *<p>
 Returns the actual version of the RFID layer.
 *</p>
 *@param sendbuf NULL
 *@param sendlen has to be 0 to be valid.
 *@param recbuf contains the version string which will be returned to host.
 *@param reclen contains the length of the valid data in recbuf.
 *@return <b>Zero</b> for OK. Else a ErrorCode according to API.h will be returned.
 */word RFID::version(byte *sendbuf, word sendlen, byte *recbuf, word &reclen) {
	if (sendlen != 0) {
		reclen = 0;
		return WRONG_LENGTH;
	}
	if (reclen > RFID_VERSION_LENGTH)
		reclen = RFID_VERSION_LENGTH;
	if (reclen < RFID_VERSION_LENGTH) {
		reclen = 0;
		return DATA_OVERFLOW;
	}
	memcpy(recbuf, (byte *) RFID_VERSION_STR, RFID_VERSION_LENGTH);
	return OK;
}

/**
 *<b>Set some necessary timeouts</b>
 *<p>
 Set either PCD_GUARD_TIME, PICC_TIMEOUT, TRANSMISSIONTIMEOUT or RECEIVE_TIMEOUT. Depends on the parameter
 which is send with.
 *</p>
 *@see Hardware Abstraction Layer Version 1.16, 4.4 RFID_CONTROL
 *@param sendbuf contains the opcode which timeout should be set and the value
 *@param sendlen has to be 2 or 3 to be valid!
 *@return <b>ZERO</b> if no error occured. Else a error code according to API.h will be returned.
 */word RFID::setTimeouts(byte *sendbuf, word sendlen) {
	if (sendlen == 2) {
		Timing(sendbuf[0], sendbuf[1]); //type, value
		return OK;
	} else if (sendlen == 3) {
		Timing(sendbuf[0], (word) (sendbuf[2]) + (word) (sendbuf[1] << 8)); //type, value
		return OK;
	} else {
		return WRONG_LENGTH;
	}
}

/**
 *<b>RFID Control</b>
 *<p>
 * Todo: add description
 *</p>
 *@param sendbuf
 *@param sendlen
 *@param recbuf
 *@param reclen
 *@return
 */
unsigned short RFID::transceive(unsigned char cmd, unsigned char* sendbuf,
		unsigned short sendlen, unsigned char* recbuf,
		unsigned short & reclen) {

	static Timer txTimer;
	static Timer tCallback;
	static Timer timeout;
	tTRF797x_IRQFlag sIrqStatusFlag;
	unsigned short ret_value = 0;
	unsigned char broken_frame_bits = 0;
	// Flag used to switch the RX setting to receive without CRC, once the
	//command to write has been sent, and a response has been received - the
	// flag will be used to switch the setting back to receive with CRC
	bool mifare_ultra_light_flag = false;
	bool iso15693_flag = false;

	if (g_sTrf7970Status.bProtocolError == true) {
		g_sTrf7970Status.bProtocolError = false;
		return RF_FRAMING_ERROR;
	}

	// Check if the packet is a broken Frame
	if (bitFrame < 8) {
		broken_frame_bits = bitFrame;
	}

  	if((g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeA == 1) &&
  			sendlen == 0x06 && sendbuf[0] == 0xA2)
  	{
  		mifare_ultra_light_flag = true;
  		// Register 01h. Chip Status Control
  		TRF797x_writeSingle(0x88, TRF79X0_ISO_CONTROL_REG);

  		TRF797x_writeSingle(0x04, TRF79X0_SPECIAL_FUNC_1_REG);
  	}
  	else
  	{
  		mifare_ultra_light_flag = false;
  	}

	if ((g_sTrf7970Status.sInitiatorMode.bits.bPassive15693 == 1)
			&& (sendbuf[0] & BIT6)) {
		iso15693_flag = true;
	}

	byte ret = TRF797x_writeFIFO(sendbuf,
			(tTRF797x_CRC) (
					bitFrame ?
							TRF79X0_TRANSMIT_NO_CRC_CMD | 0x80 :
							TRF79X0_TRANSMIT_CRC_CMD | 0x80), sendlen,
			broken_frame_bits);
	if (reclen == 0) {
		if (ret == OK)
			ret_value = OK;
		else
			ret_value = RF_FRAMING_ERROR;
	} else {
		if (iso15693_flag == true) {
			waitms(15);
			TRF797x_directCommand(TRF79X0_TRANSMIT_NEXT_SLOT_CMD);
		}

		sIrqStatusFlag = TRF797x_irqHandler(_PICCTimeout);

