filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/nfclink/nfclinklib/Source/RFID/RFID.cpp
		if (sIrqStatusFlag == IRQ_STATUS_RX_COMPLETE) {
			// Read the mailbox
			reclen = mailbox.used();
			mailbox.Read(recbuf, reclen);
			ret_value = OK;
		} else if (sIrqStatusFlag == IRQ_STATUS_PROTOCOL_ERROR) {
			reclen = 0;
			ret_value = RF_FRAMING_ERROR;
		} else {
			reclen = 0;
			ret_value = NO_ANSWER_FROM_TAG;
		}

  		if(mifare_ultra_light_flag == true)
  		{
  			TRF797x_writeSingle(0x00, TRF79X0_SPECIAL_FUNC_1_REG);
  			// Register 01h. Chip Status Control
  			TRF797x_writeSingle(0x08, TRF79X0_ISO_CONTROL_REG);
  		}
  	}

	return ret_value;
}

void RFID::HFField(char state) {

	if (state == 0) {
		TRF797x_setField(EXT_FIELD_OFF);
	} else {
		TRF797x_setField(EXT_FIELD_ON);
	}
}

void RFID::FieldReset(word msec) {
	HFField(0);
	waitms(msec);
	HFField(1);
}

word RFID::FrameType(byte option, byte param) {
	//FlushFIFO();
	//mailbox.flush();

	//if(current_frame_type == option && current_frame_param == param)    //for timing-optimisation. ToDo: start AAC() always if frame_type remains unchanged (NFC)
	//  return OK;                                                        //ToDo: NO_TAG_MODE has same value as LISTEN_ABF_PASSIVE

	current_frame_type = option;
	current_frame_param = param;

	switch (option) {
	case ISO14443A_BITFRAME:
		SetupFrame(ISO14443A_BYTEFRAME);
		Setup14443A_Bitframe(param);
		break;

	case ISO14443A_BYTEFRAME:
		SetupFrame(ISO14443A_BYTEFRAME);
		Setup14443A_Byteframe();
		break;

	case ISO14443B_BYTEFRAME:
		SetupFrame(ISO14443B_BYTEFRAME);
		break;

	case NFC_TARGET_PASSIVE:
		SetupFrame(param);
		break;

	case FELICA_BYTEFRAME:
		SetupFrame(FELICA_BYTEFRAME);
		break;
	case ISO15693_BYTEFRAME:
		SetupFrame(ISO15693_BYTEFRAME);
		break;
	case NO_TAG_MODE:
		SetupFrame(NO_TAG_MODE);
		break;

		//   case GTML_BYTEFRAME:
		//       SetupFrame(GTML_BYTEFRAME);
		//       break;
		//
		//   case NFC_INITIATOR_ACTIVE:
		//       SetupFrame(NFC_INITIATOR_ACTIVE);
		//       break;
		//
		//   case NFC_TARGET_ACTIVE:
		//       SetupFrame(NFC_TARGET_ACTIVE);
		//       break;
		//
		//	case LISTEN_A_PASSIVE:
		//		SetupFrame(LISTEN_A_PASSIVE);
		//		break;
		//	case LISTEN_B_PASSIVE:
		//		SetupFrame(LISTEN_B_PASSIVE);
		//		break;
		//	case LISTEN_F_PASSIVE:
		//		SetupFrame(LISTEN_F_PASSIVE);
		//		break;

	default:
		//DebugPrint::Write("\nunknown FrameType %04x in RFID\n", option);
		return WRONG_PARAMETER;
	}

	TRF797x_displayMode();

	return OK;
}

/**
 *<b>Setup 14443A-Bitframe</b>
 *<p>
 * Bitframe is used for REQA and Anticollision. THis function sets up the TRF7970A to receive broken byte packets.
 *</p>
 *@param bitcount contains the total number of bits to send in a bitframe
 */
void RFID::Setup14443A_Bitframe(byte bitcount) {

	bitFrame = bitcount;
	TRF797x_writeSingle(0x88, TRF79X0_ISO_CONTROL_REG);
}

void RFID::Setup14443A_Byteframe() {

	bitFrame = 0x00;
}

/**
 *<b>RFID Control</b>
 *<p>
 * Todo: add description
 *</p>
 *@param sendbuf
 *@param sendlen
 *@param recbuf
 *@param reclen
 *@return
 */

unsigned short RFID::baudrate_air(unsigned char baudrate) {

	word ret;
	t_sTRF797x_Bitrate eBaudRate;

	switch (baudrate) {
	case BAUDRATE_106:
		eBaudRate.bits.b106kpbs = 1;
		break;
	case BAUDRATE_212:
		eBaudRate.bits.b212kpbs = 1;
		// Change selectedFrameType when increasing the bitrate for P2P mode
		if (g_sTrf7970Status.bNfcModeEnabled == true)
			selectedFrameType = FELICA_BYTEFRAME;
		break;
	case BAUDRATE_424:
		eBaudRate.bits.b424kpbs = 1;
		// Change selectedFrameType when increasing the bitrate for P2P mode
		if (g_sTrf7970Status.bNfcModeEnabled == true)
			selectedFrameType = FELICA_BYTEFRAME;
		break;
	case BAUDRATE_848:
		eBaudRate.bits.b848kpbs = 1;
		break;
	}

	selectedBaudrate = baudrate;

	if (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE) {
		TRF797x_incrementTargetBaudRate(eBaudRate);
		ret = OK;
	} else if (g_sTrf7970Status.eCurrentMode == TRF_INITIATOR_MODE) {
		TRF797x_incrementInitiatorBaudRate(eBaudRate);
		ret = OK;
	} else {
		ret = GENERAL_ERROR;
	}

	return ret;

}

/**
 *<b>Read Mailbox</b>
 *<p>
 * Before checking the mailbox run once rfid::run when using NFC-TargetMode resp. transceive when using Initiator-mode. If data is
 * available it will be written into recbuf.
 *</p>
 *@see API.h
 *@param recbuf will contains the received data from target
 *@param reclen will contain the length of the valid data in recbuf
 *@param recbuf contains the answer from target if received.
 *@param reclen contains the length of valid data in recbuf
 *@return OK on success
 *        MORE_DATA\RF_FRAMING_ERR_MORE_DATA if isRxMultiple is true and more frames are available
 *        RF_FRAMING_ERROR on CRC, Parity error, etc.
 */word RFID::readMailbox(byte *recbuf, word &reclen) {
	word len;

	if (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE) {

		if (g_sTrf7970Status.bProtocolError) {
			reclen = 0;
			g_sTrf7970Status.bProtocolError = false;
			return RF_FRAMING_ERROR;
		}
		if (g_sTrf7970Status.bRfFieldOn == false) {
			reclen = 0;
			g_sTrf7970Status.bRfFieldOn = true;
			g_sTrf7970Status.bProtocolError = false;
			return RF_FRAMING_ERROR;
		}

		len = mailbox.used(); //get how many bytes are in the mailbox buffer
		if (len == 0) {
			reclen = 0;
			return NO_ANSWER_FROM_TAG;
		}
		if (len > reclen) { //more data in buffer than expected. Reclen too short!
			mailbox.flush();
			reclen = 0;
			return DATA_OVERFLOW;
		}

		//len-=2;
		reclen = 0;
		reclen = mailbox.Read(recbuf, len);
		mailbox.flush();
		return OK;
	} else
		return GENERAL_ERROR;

}

word RFID::control(byte *sendbuf, word sendlen, byte *recbuf, word &reclen) {
	word ui16Command;

	ui16Command = sendbuf[0];

	switch (ui16Command)
	{
	case PCD_GUARD_TIME:
	case PICC_TIMEOUT:
	case TRANSMISSIONTIMEOUT:
	case RECEIVE_TIMEOUT:
	{
		reclen = 0;
		return setTimeouts(sendbuf, sendlen);
	}
	case REG_READ:
	{
		if (sendlen != 2) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		if (reclen != 1) {
			reclen = 0;
			return DATA_OVERFLOW;
		}
		TRF797x_readSingle(recbuf, sendbuf[1]);
		reclen = 1;
		return OK;
	}
	case REG_WRITE:
	{
		if (sendlen != 3) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		TRF797x_writeSingle(sendbuf[2], sendbuf[1]); //value, adr
		reclen = 0;
		return OK;
	}
	case FIELD_RESET:
	{
		if (sendlen != 2) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		FieldReset(sendbuf[1]); //msec
		reclen = 0;
		return OK;
	}
	case RCRESET:
	{
		if (sendlen != 1) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		//CHECK(HW::Call(HW_RC_RESET));
		reclen = 0;
		return OK;
	}
	case HF_FIELD:
	{
		if (sendlen != 2) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		if (sendbuf[1] & 0xFE) {
			reclen = 0;
			return WRONG_PARAMETER;
		} //must be 0x00 or 0x01
		HFField(sendbuf[1]); //state
		reclen = 0;
		return OK;
	}
	case MODINDEX:
	{
		if (sendlen != 2) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		//ModIndex_value = sendbuf[1];
		//RFID::Write(ModGsPReg, ModIndex_value);
		reclen = 0;
		return OK;
	}
	case MF_AUTHBIT_CLEAN: //clean the bit which turns the crypto-unit on
	{
		if (sendlen != 1) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		//ClearBits(Status2Reg, 0x08); //Write(Status2Reg,0x00);
		reclen = 0;
		return OK;
	}
	case POSSIBLE_BAUDRATE_AIR:
	{
		if (sendlen != 1) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		if (reclen < 1) {
			reclen = 0;
			return DATA_OVERFLOW;
		}
		recbuf[0] = BAUDRATE_848;
		reclen = 1;
		return OK;
	}
	case BAUDRATE_AIR: //change the airinterface speed
	{
		if (sendlen != 2) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		reclen = 0;
		return baudrate_air(sendbuf[1]);
		//return 0;
	}
	case CHECK_RF: //check the external RFFieldl
	{
		if (sendlen != 1) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		if (reclen < 1) {
			reclen = 0;
			return DATA_OVERFLOW;
		}
		recbuf[0] = g_sTrf7970Status.bRfFieldOn;
		reclen = 1;
		return OK;
	}
	case SET_RECEIVING: //put the PN512 into receive mode ->nfc mode
	{
		if (sendlen != 2) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		if (sendbuf[1] == 0x00) {
			//RFID::Write(CommandReg, PCD_IDLE);
		} //put the pn512 in the idle mode
		if (sendbuf[1] == 0x01) {
			//RFID::Write(CommandReg, PCD_RECEIVE);
		} //put the pn512 in the receive mode
		reclen = 0;
		return OK;
	}
	case TARGET_AC_TEST:
	{
		if (sendlen != 1 && sendlen != 2) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		TRF797x_setTargetSelect(false);
//		NFCTarget_init_light();
		reclen = 0;
		return OK;
	}
	case POWER_SAVE:
	{
		if (sendlen != 1 && sendlen != 2) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		//RFID::HFField(0);
		//RFID::Write(CommandReg, 0x30);
		reclen = 0;
		return OK;
	}
	case RX_GAIN:
	{
		if (sendlen != 2) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		//RFID::Write(RFCfgReg, (sendbuf[1] & 0x7f));
		//rcf_sensitivity = (sendbuf[1] & 0x7f);
		reclen = 0;
		return OK;
	}
	case CRC_ENABLE:
	{
		if (sendlen != 2) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		if (sendbuf[1] & 0xFE) {
			reclen = 0;
			return WRONG_PARAMETER;
		}
		//byte ret = RFID::Read(RxModeReg);
		if (sendbuf[1]) {
			bitFrame = false;
		} else {
			bitFrame = true;
		}
		reclen = 0;
		return OK;
	}
	case THRESHOLD:
	{
		if (sendlen != 2) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		//Treshold = sendbuf[1];
		//RFID::Write(RxTresholdReg, sendbuf[1]);
		reclen = 0;
		return OK;
	}
	case BITCOLLISION:
	{
		if (sendlen != 1) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		if (reclen < 1) {
			reclen = 0;
			return DATA_OVERFLOW;
		}
		recbuf[0] = BitCollision();
		reclen = 1;
		return OK;
	}
	case GET_RANDOM_ID:
	{
		if (reclen < 10) {
			reclen = 0;
			return DATA_OVERFLOW;
		}
		uint8_t len = 0;
		//FlushFIFO();
		//RFID::Write(CommandReg, PCD_GenRandomID); //genarate a random ID
		//waitus(500);
		//SetBits(ControlReg, 0x20); //copy random ID into FIFO
		//while (Read(FIFOLevelReg) && (reclen > len)) {
		//	recbuf[len++] = Read(FIFODataReg);
		//}
		while (len < reclen) {
			recbuf[len] = len;
			len++;
		}

		reclen = len;
		return OK;
	}
	case AAC_CONFIGURATION:
	{
		return aacConfiguration(sendbuf, sendlen, recbuf, reclen);
	}
	case CHECK_PON:
	{
		//return checkPON(recbuf, reclen);
		return 0;
	}
	case TARGET_ACTIVATED:
	{
		return checkTargetActivated(recbuf, reclen);
	}
	case RX_MULTIPLE:
	{
		if (sendlen != 2) {
			reclen = 0;
			return WRONG_LENGTH;
		}
		if (sendbuf[1] == 0x01) {
			//SetBits(RxModeReg, 0x04);
			isRxMultiple = true;
		} else if (sendbuf[1] == 0x00) {
			//ClearBits(RxModeReg, 0x04);
			isRxMultiple = false;
		} else {
			reclen = 0;
			return WRONG_PARAMETER;
		}
		if (reclen >= 1) {
			//recbuf[0] = (isRxMultiple ? 0x01 : 0x00);
			reclen = 1;
		}
		return OK;
	}
	case BAUDRATE_AIR_V:
	{
		word ret = OK;
		t_sTRF797x_Bitrate eBaudRate;

