filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/nfclink/nfclinklib/Source/RFID/RFID.cpp
		if(sendbuf[1] == TX)
		{
			switch(sendbuf[2])
			{
			case BAUDRATE_1_66:
				eBaudRate.bits.b6_62_kbps_1_out_4 = 1;
				break;
			case BAUDRATE_26_48:
				eBaudRate.bits.b26_48_kbps_1_out_4 = 1;
				break;
			default:
				ret = GENERAL_ERROR;
				break;
			}

			if(ret == OK)
			{
				TRF797x_incrementInitiatorBaudRate(eBaudRate);
			}

			return ret;
		}
		else if(sendbuf[1] == RX)
		{
			switch(sendbuf[2])
			{
			case BAUDRATE_6_62:
				eBaudRate.bits.b6_62_kbps_1_out_4 = 1;
				break;
			case BAUDRATE_26_48:
				eBaudRate.bits.b26_48_kbps_1_out_4 = 1;
				break;
			default:
				ret = GENERAL_ERROR;
				break;
			}

			if(ret == OK)
			{
				TRF797x_incrementInitiatorBaudRate(eBaudRate);
			}

			return ret;
		}
		else
		{
			return GENERAL_ERROR;
		}
//	case AAC_DE_INIT:
//		// TOODO
//		break;
	}
	default:
		reclen = 0;
		return UNKNOWN_COMMAND;
	}
}

unsigned short RFID::modeDetection(byte* recbuf, word & reclen) {

	recbuf[0] = selectedFrameType;
	recbuf[1] = selectedBaudrate;
	reclen = 2;
	return OK;
}

/**
 *<b>Check Target Activated</b>
 *<p>
 Will return '1' if the Select command or if the Polling command was answered.
 *</p>
 *@param recbuf contains the indicating byte. 0x01 -> got selected, 0x00-> not
 *@param reclen has to be at minimum 1 and will return 1 byte.
 *@return <b>ZERO</b> if no error occured. Else a error code according to API.h will be returned.
 */
unsigned short RFID::checkTargetActivated(unsigned char* recbuf,
		unsigned short & reclen) {

	if (reclen < 1) {
		reclen = 0;
		return DATA_OVERFLOW;
	}

	if (g_sTrf7970Status.bTargetSelected == true) {
		recbuf[0] = 0x01;
		//DebugPrint::Write("\nTargetActivated");
	} else {
		recbuf[0] = 0x00;
		//DebugPrint::Write("\nnoTargetActivated");
	}

	reclen = 1;
	return OK;

}

/**
 * <b>AAC configuration</b>
 * <p>
 * This method dispatches the incomming data to several functions to configure the AAC().
 * </p>
 * @param sendbuf contains the from host received data. sendbuf[0]=sub-opcode 'AAC_CONFIGURATION' + sendbuf[1]=sub-sub-opcode 'SENS_RES' (for example) + sendbuf[i] = data
 * @param sendlen contains the length of received data
 * @param recbuf contains the data returned to host. At SENS_RES for example: 0x44, 0x00
 * @param reclen contains the length of data returned to host. At SENS_RES it will be 2.
 * @return <b>ZERO</b> if no error occured. Else a error code according to API.h will be returned.
 */word RFID::aacConfiguration(byte *sendbuf, word sendlen, byte *recbuf,
		word &reclen) {
	/* sendbuf+2/sendlen-2 to cut off the opcodes */
	switch (sendbuf[1]) {
	case SENS_RES: //r/w
		return sgSensRes(sendbuf + 2, sendlen - 2, recbuf, reclen);

	case NFCID1: //r/w
		return sgNfcid1(sendbuf + 2, sendlen - 2, recbuf, reclen);

	case SEL_RES: //r/w
		return sgSelRes(sendbuf + 2, sendlen - 2, recbuf, reclen);

		//	case NFCID2: //r/w
		//		return sgNfcid2(sendbuf + 2, sendlen - 2, recbuf, reclen);
		//
		//	case SYS_CODE: //r/w
		//		return sgSysCode(sendbuf + 2, sendlen - 2, recbuf, reclen);

	case AAC_PADDING: //r/w    // Felica PMM
		return sgPadding(sendbuf + 2, sendlen - 2, recbuf, reclen);

	case PUPI_REG: //-/w
		return setPupi(sendbuf + 2, sendlen - 2, recbuf, reclen);

	case AAC_ATQB: //r/w
		return sgAtqb(sendbuf + 2, sendlen - 2, recbuf, reclen);

	case AAC_AFI: //r/w
		return sgAfi(sendbuf + 2, sendlen - 2, recbuf, reclen);

	case LF_T3T_MAX: //-/w
		return getLfT3tMax(sendlen - 2, recbuf, reclen);

	case LF_T3T_FLAGS: //r/w
		return sgLfT3tFlags(sendbuf + 2, sendlen - 2, recbuf, reclen);

	case LF_T3T_IDENTIFIERS_1:
	case LF_T3T_IDENTIFIERS_2:
	case LF_T3T_IDENTIFIERS_3:
	case LF_T3T_IDENTIFIERS_4:
	case LF_T3T_IDENTIFIERS_5:
	case LF_T3T_IDENTIFIERS_6:
	case LF_T3T_IDENTIFIERS_7:
	case LF_T3T_IDENTIFIERS_8:
	case LF_T3T_IDENTIFIERS_9:

	case LF_T3T_IDENTIFIERS_10:
	case LF_T3T_IDENTIFIERS_11:
	case LF_T3T_IDENTIFIERS_12:
	case LF_T3T_IDENTIFIERS_13:
	case LF_T3T_IDENTIFIERS_14:
	case LF_T3T_IDENTIFIERS_15:
	case LF_T3T_IDENTIFIERS_16:
		return sgLfT3tIdentifier(sendbuf + 1, sendlen - 1, recbuf, reclen);

	case LF_PROTOCOL_TYPE:
		return sgLfProtocolType(sendbuf + 2, sendlen - 2, recbuf, reclen);

	case LF_ADV_FEAT:
		return sgLfAdvFeat(sendbuf + 2, sendlen - 2, recbuf, reclen);

	case LF_CON_BITR_F:
		return sgLfConBitrF(sendbuf + 2, sendlen - 2, recbuf, reclen);

	case LN_NFC_DEP:
		return sgLnNfcDep(sendbuf + 2, sendlen - 2, recbuf, reclen);

	default:
		reclen = 0;
		return UNKNOWN_COMMAND;
	}
}

/**
 * <b> Set Get LN_NFC_DEP </b>
 * <p>
 * Todo: add description
 * </p>
 * @see Hardware Abstraction Layer 1.34 4.4.18.4 LN_NFC_DEP
 * @param sendbuf
 * @param sendlen
 * @param recbuf
 * @param reclen
 * @return
 */word RFID::sgLnNfcDep(byte *sendbuf, word sendlen, byte *recbuf,
		word &reclen) {
	/* not implemented yet, is supposed to be like an T3T Identifier for the DH */
	if (sendlen == 10) {
		memcpy(nfcid2.data, sendbuf + 2, 8);
		nfcid2.len = 8;

//		setNfcid2(sendbuf + 2, 8);

		memcpy(AACconfig.sys_code, sendbuf, 2);
		reclen = 0;
		return OK;
	} else if (sendlen == 0 && reclen >= 10) {
		memcpy(recbuf, AACconfig.sys_code, 2);
		memcpy(recbuf + 2, nfcid2.data, 8);
	} else
		return DATA_OVERFLOW;

	return OK;

	//   reclen = 0;
	//   return OK;
}

/**
 * <b>Set Get LF_CON_BITR_F </b>
 * <p>
 * Todo: add description
 * </p>
 * @see Hardware Abstraction Layer Specification 1.34 4.4.18.13 LF_CON_BITR_F
 * @see NFCForum-TS-NCI-1.0 Table 35
 * @param sendbuf
 * @param sendlen
 * @param recbuf
 * @param reclen
 * @return
 */word RFID::sgLfConBitrF(byte *sendbuf, word sendlen, byte *recbuf,
		word &reclen) {
	if (sendlen == 1) {
		AACconfig.lfConBitrF = sendbuf[0];
		reclen = 0;
	} else if (sendlen == 0) {
		if (reclen == 0)
			return DATA_OVERFLOW;
		recbuf[0] = AACconfig.lfConBitrF;
		reclen = 1;
	} else {
		return WRONG_LENGTH;
	}
	return OK;
}

/**
 * <b> Set Get LF_ADV_FEAT </b>
 * <p>
 * Todo: add description
 * </p>
 * @see NFCForum-TS-NCI-1.0 Table 35
 * @param sendbuf
 * @param sendlen
 * @param recbuf
 * @param reclen
 * @return
 */word RFID::sgLfAdvFeat(byte *sendbuf, word sendlen, byte *recbuf,
		word &reclen) {
	if (sendlen == 1) {
		AACconfig.lfAdvFeat = sendbuf[0];
		reclen = 0;
	} else if (sendlen == 0) {
		if (reclen == 0)
			return DATA_OVERFLOW;
		recbuf[0] = AACconfig.lfAdvFeat;
		reclen = 1;
	} else {
		return WRONG_LENGTH;
	}
	return OK;
}

/**
 * <b> Set Get LF_PROTOCOL_TYPE </b>
 * <p>
 * Todo: add description
 * </p>
 * @param sendbuf
 * @param sendlen
 * @param recbuf
 * @param reclen
 * @return
 */word RFID::sgLfProtocolType(byte *sendbuf, word sendlen, byte *recbuf,
		word &reclen) {
	if (sendlen == 1) {
		AACconfig.lfProtocolType = sendbuf[0];
		if (AACconfig.lfProtocolType & 0x02) {
			// TODO Ensure that when P2P mode is enabled this bit is set
			g_sTrf7970Status.bNfcModeEnabled = 1;
			g_bNfcTargetEnable = true;
		} else {
			g_sTrf7970Status.bNfcModeEnabled = 0;
			g_bNfcTargetEnable = false;
		}
		reclen = 0;
		return OK;
	} else if (sendlen == 0) {
		if (reclen < 1)
			return DATA_OVERFLOW;
		recbuf[0] = AACconfig.lfProtocolType;
		reclen = 1;
		return OK;
	}
	return WRONG_LENGTH;
}

/**
 * <b> Set Get LF_T3T_IDENTIFIERS 1-16 </b>
 * <p>
 * Todo: add description
 * </p>
 * @param sendbuf
 * @param sendlen
 * @param recbuf
 * @param reclen
 * @return
 */word RFID::sgLfT3tIdentifier(byte *sendbuf, word sendlen, byte *recbuf,
		word &reclen) {
	//sendbuf[0] is the Identifiers ID (1-16)
	if (sendlen == 11) {
		memcpy(AACconfig.sys_code, sendbuf + 1, 2);
		memcpy(nfcid2.data, sendbuf + 3, 8);
//		setNfcid2(sendbuf + 3, 8);
		return OK;
	} else if (sendlen == 1) {
		if (reclen < 10)
			return DATA_OVERFLOW;
		memcpy(recbuf, AACconfig.sys_code, 2);
		memcpy(recbuf + 2, nfcid2.data, 8);
		return OK;
	} else {
		return WRONG_LENGTH;
	}
	//   return GENERAL_ERROR;
}

/**
 * <b> Set Get LF_T3T_FLAGS </b>
 * <p>
 * Todo: add description
 * </p>
 * @param sendbuf
 * @param sendlen
 * @param recbuf
 * @param sendlen
 * @return
 */word RFID::sgLfT3tFlags(byte *sendbuf, word sendlen, byte *recbuf,
		word &reclen) {
	if (sendlen == 2) {
		AACconfig.lfT3tFlags[0] = sendbuf[0];
		AACconfig.lfT3tFlags[1] = sendbuf[1];
		reclen = 0;
	} else if ((sendlen == 0) && (reclen >= 2)) {
		recbuf[0] = AACconfig.lfT3tFlags[0];
		recbuf[1] = AACconfig.lfT3tFlags[1];
		reclen = 2;
	} else {
		reclen = 0;
		return WRONG_LENGTH;
	}
	return OK;
}

/**
 * <b> Get LF_T3T_MAX </b>
 * <p>
 * Returns the value of LF_T3T_MAX. Specified at NFCForum-TS-NCI-1.0 6.1.8 Listen F Parameters
 * Table 35.
 * This register is read only and one byte data will be returned. Valid return values are 00h-0Fh.
 * </p>
 * @param sendlen contains the sendlen. SHALL be zero.
 * @param recbuf contains the returned data.
 * @param reclen is the maximum available recbuf size and will be changed to the returned length of data.
 * @return <b>OK</b> if no error occured. Else a error code according to 1.10 Error codes will be returned.
 */word RFID::getLfT3tMax(word sendlen, byte *recbuf, word &reclen) {
	if (sendlen != 0)
		return WRONG_LENGTH;

	if (reclen == 0)
		return DATA_OVERFLOW;

	recbuf[0] = HAL_LF_T3T_MAX;
	reclen = 1;
	return OK;
}

/**
 *<b>Set/Get AFI</b>
 *<p>
 Todo: add description
 *</p>
 *@see ISO/IEC 14443-3 7.9 ATQB Response
 *@param sendbuf
 *@param sendlen
 *@param recbuf
 *@param reclen
 *@return
 */word RFID::sgAfi(byte *sendbuf, word sendlen, byte *recbuf, word &reclen) {
	if (sendlen == 1) {
		AACconfig.afi = sendbuf[0];
//		setAFI(sendbuf[0]);
		reclen = 0;
		return OK;
	} else if (sendlen == 0) {
		if (reclen < 1) {
			reclen = 0;
			return DATA_OVERFLOW;
		}
		reclen = 1;
		recbuf[0] = AACconfig.afi;
		return OK;
	} else {
		reclen = 0;
		return WRONG_LENGTH;
	}
}

/**
 * <b>Set/Get PUPI</b>
 * <p>
 * Write and read PUPI register. With sendlen of 4 it is possible to write the pupi register. With
 * sendlen of 0 you can read the pupi register. At a read access the reclen has to be at minimum 4.
 * </p>
 * @see ISO/IEC 14443-3 7.9 ATQB Response
 * @param sendbuf contains the data which will be written in pupi register
 * @param sendlen contains the length of sendbuffer. Has to be 0 or 4.
 * @param recbuf contains the data of pupi req.
 * @param reclen contains the length of recbuffer
 * @return <b>ZERO</b> if no error occured. Else a error code according to API.h will be returned.
 */word RFID::setPupi(byte *sendbuf, word sendlen, byte *recbuf, word &reclen) {
	if (sendlen == 4) {
		memcpy(AACconfig.pupi, sendbuf, 4);
//		setPupi_(sendbuf, 4);
		reclen = 0;
		return OK;
	} else if (sendlen == 0) {
		if (reclen < 4) {
			reclen = 0;
			return DATA_OVERFLOW;
		}
		memcpy(recbuf, AACconfig.pupi, 4);
		reclen = 4;
		return OK;
	} else {
		reclen = 0;
		return WRONG_LENGTH;
	}
}

/**
 * <b>Set/Get ATQB</b>
 * <p>
 * Write and read the ATQB register. A write command has to be 6 or 7 byte long. Depends if extended
 * ATQB or normal is used. The parameters are written in the order:
 * - CRC-AID: 2 byte. Default: '00 00'
 * - NUMBER_APLI: 1 byte. Default: '00'
 * - PROTO_INFO: 3-4 byte. Default: '00 00 E4'
 * With a sendlen of 0 and a reclen greater or equal 7 you can read the current settings of ATQB.
 * </p>
 * @see Kronegger HAL Specification 1.23 4.4.18.10 AAC_ATQB
 * @see ISO/IEC 14443-3 7.9 ATQB Response
 * @param sendbuf
 * @param sendlen
 * @param recbuf
 * @param reclen
 * @return
 */word RFID::sgAtqb(byte *sendbuf, word sendlen, byte *recbuf, word &reclen) {
	if (sendlen == 6 || sendlen == 7) {
		memcpy(AACconfig.crc_aid, sendbuf, 2);
		AACconfig.number_apli = sendbuf[2];
		memcpy(AACconfig.proto_info, sendbuf + 3, sendlen - 3);
//		setCRCAid(sendbuf, 2);
//		setNumberApli(sendbuf[2]);
//		setProtoInfo(sendbuf + 3, sendlen - 3);
		reclen = 0;
		return OK;
	} else if (sendlen == 0) {
		if (reclen < 7) {
			reclen = 0;
			return DATA_OVERFLOW;
		}
		reclen = 7;
		memcpy(recbuf, AACconfig.crc_aid, 2);
		recbuf[2] = AACconfig.number_apli;
		memcpy(recbuf + 3, AACconfig.proto_info, 4);
		return OK;
	} else {
		reclen = 0;
		return WRONG_LENGTH;
	}
}

/**
 *<b>Set/Get SYS_CODE</b>
 *<p>
 Todo: add description
 *</p>
 *@param sendbuf
 *@param sendlen
 *@param recbuf
 *@param reclen
 *@return
 */word RFID::sgSysCode(byte *sendbuf, word sendlen, byte *recbuf, word &reclen) {
	if (sendlen == 2) { //write
		memcpy(AACconfig.sys_code, sendbuf, 2);
//		setSysCode(sendbuf, 2);
		reclen = 0;
		return OK;
	} else if (sendlen == 0) { //read
		if (reclen >= 2) {
			memcpy(recbuf, AACconfig.sys_code, 2);
			reclen = 2;
			return OK;
		} else {
			reclen = 0;
			return DATA_OVERFLOW;
		}
	} else {
		reclen = 0;
		return WRONG_LENGTH;
	}
}

/**
 * <b>Set/Get NFCID2</b>
 * <p>
 * Write and read the NFCID2. The NFCID2 is used for passive communication with 212 and 424kbaud.
 * The NFCID2 can be written in two different ways. With a sendlen of 06h the first two bytes of
 * the NFCID2 are fixed to 02h FEh and the six bytes are attached.
 * With a sendlen of 08h also the first two bytes are written.
 * To read the NFCID2 the sendlen has to be 00h and the reclen at minimum 08h.
 * </p>
 * @see ISO/IEC 18092 11.2.2.4 NFCID2 contents
 * @param sendbuf contains the NFCID2 with or without prefix.
 * @param sendlen contains the length of sendbuf. Allowed length: 0, 6 and 8.
 * @param recbuf contains the current setting of the NFCID2
 * @param reclen contains the length of recbuf. At minimum 8.
 * @return <b>ZERO</b> if no error occured. Else a error code according to API.h will be returned.
 */word RFID::sgNfcid2(byte *sendbuf, word sendlen, byte *recbuf, word &reclen) {
	if (sendlen == 6) { //write
		nfcid2.data[0] = 0x02;
		nfcid2.data[1] = 0xFE;
		memcpy(nfcid2.data + 2, sendbuf, sendlen);
		nfcid2.len = 8;
//		setNfcid2(nfcid2.data, 8);
		reclen = 0;
		return OK;
	} else if (sendlen == 8) {
		memcpy(nfcid2.data, sendbuf, sendlen);
		nfcid2.len = 8;
//		setNfcid2(nfcid2.data, 8);
		reclen = 0;
		return OK;
	} else if (sendlen == 0) { //read
		if (reclen >= 8) {
			memcpy(recbuf, nfcid2.data, nfcid2.len);
			reclen = nfcid2.len;
			return OK;
		} else {
			reclen = 0;
			return DATA_OVERFLOW;
		}
	} else {
		reclen = 0;
		return WRONG_LENGTH;
	}
}

/**
 *<b>Set/Get SEL_RES/SAK</b>
 *<p>
 Todo: add description
 *</p>
 *@param sendbuf
 *@param sendlen
 *@param recbuf
 *@param reclen
 *@return
 */word RFID::sgSelRes(byte *sendbuf, word sendlen, byte *recbuf, word &reclen) {
	if (sendlen == 1) { //write
		AACconfig.sel_res = sendbuf[0];
//		setSelRes(sendbuf[0]);
		reclen = 0;
		return OK;
	} else if (sendlen == 0) { //read
		if (reclen >= 1) {
			recbuf[0] = AACconfig.sel_res;
			reclen = 1;
			return OK;
		} else {
			reclen = 0;
			return DATA_OVERFLOW;
		}
	} else {
		reclen = 0;
		return WRONG_LENGTH;
	}
}

/**
 * <b>Set/Get NFCID1</b>
 * <p>
 * With this opcode the NFCID1 for Listen Modes can be configured. It is possible to write 3 or 4 bytes
 * NFCID. If you write only 3 bytes the first one of the four byte NFCID is fixed to 0x08 which indicates
 * a random generated UID. If you write 4 bytes, the first byte is overwritten aswell.
 * If the sendlen is zero you can read the current NFCID. For this reclen as to be at minimum 4.
 * </p>
 * @see NFCForum-TS-DigitalProtocol Requirements 17: NFCID1 Length
 * @param sendbuf contains the NFCID1 which will be written. Three or four bytes.
 * @param sendlen contains the length of sendbuffer. Has to be 0, 3 or 4.
 * @param recbuf contains the current NFCID1 settings.
 * @param reclen contains the length of recbuffer and has to be at minimum 4.
 * @return <b>ZERO</b> if no error occured. Else a error code according to API.h will be returned.
 */word RFID::sgNfcid1(byte *sendbuf, word sendlen, byte *recbuf, word &reclen) {
	if (sendlen == 3) {
		nfcid1.data[0] = 0x08;
		memcpy(nfcid1.data + 1, sendbuf, sendlen);
		nfcid1.len = 4;
//		setNfcid1(nfcid1.data, 4);
		//		DebugPrint::Write("\nsetID:");
		//		DebugPrint::Hex(nfcid1.data, 4);
		reclen = 0;
		return OK;
	} else if (sendlen == 4) {
		memcpy(nfcid1.data, sendbuf, sendlen);
		nfcid1.len = 4;
//		setNfcid1(nfcid1.data, 4);
		reclen = 0;
		return OK;
	} else if (sendlen == 0) {
		if (reclen >= nfcid1.len) {
			memcpy(recbuf, nfcid1.data, nfcid1.len);
			reclen = nfcid1.len;
			return OK;
		} else {
			reclen = 0;
			return DATA_OVERFLOW;
		} //reclen to short
	} else {
		reclen = 0;
		return WRONG_LENGTH;
	}
}

/**
 *<b>Set/Get SENS_RES</b>
 *<p>
 Todo: add description
 *</p>
 *@param sendbuf
 *@param sendlen
 *@param recbuf
 *@param reclen
 *@return
 */word RFID::sgSensRes(byte *sendbuf, word sendlen, byte *recbuf, word &reclen) {
	if (sendlen == 2) { //write
		memcpy(AACconfig.sens_res, sendbuf, 2);
//		setSensRes(sendbuf, 2);
		reclen = 0;
		return OK;
	} else if (sendlen == 0) { //read
		if (reclen >= 2) {
			recbuf[0] = AACconfig.sens_res[0];
			recbuf[1] = AACconfig.sens_res[1];
			reclen = 2;
			return OK;
		} else {
			reclen = 0;
			return DATA_OVERFLOW;
		} //reclen to short
	} else {
		reclen = 0;
		return WRONG_LENGTH;
	}
}
/**
 *<b>Set/Get Padding</b>
 *<p>
 Todo: add description
 *</p>
 *@see ISO/IEC 14443-3 7.9 ATQB Response
 *@param sendbuf
 *@param sendlen
 *@param recbuf
 *@param reclen
 *@return
 */word RFID::sgPadding(byte *sendbuf, word sendlen, byte *recbuf, word &reclen) //PMM
		{
	if (sendlen == 8) {
		memcpy(AACconfig.Padding, sendbuf, 8);
//		setPadding(sendbuf, 8);
		reclen = 0;
		return OK;
	} else if (sendlen == 0) {
		if (reclen < 8) {
			reclen = 0;
			return DATA_OVERFLOW;
		}
		reclen = 8;
		memcpy(recbuf, AACconfig.Padding, 8);
		return OK;
	} else {
		reclen = 0;
		return WRONG_LENGTH;
	}
}

///--------------------------------------------------------------------------------------
///--------------------------------------------------------------------------------------

///--------------------------------------------------------------------------------------
///--------------------------------------------------------------------------------------

///--------------------------------------------------------------------------------------
///--------------------------------------------------------------------------------------

///--------------------------------------------------------------------------------------
///--------------------------------------------------------------------------------------

///--------------------------------------------------------------------------------------
///--------------------------------------------------------------------------------------

///--------------------------------------------------------------------------------------
///--------------------------------------------------------------------------------------

///--------------------------------------------------------------------------------------
///--------------------------------------------------------------------------------------

///--------------------------------------------------------------------------------------
///--------------------------------------------------------------------------------------

///--------------------------------------------------------------------------------------
///--------------------------------------------------------------------------------------

///--------------------------------------------------------------------------------------
///--------------------------------------------------------------------------------------

///--------------------------------------------------------------------------------------
///--------------------------------------------------------------------------------------

///--------------------------------------------------------------------------------------
///--------------------------------------------------------------------------------------

//*****************************************************************************
//
// This function initializes the TRF97x0 Enable, Slave Select, and SPI module.
//
//*****************************************************************************
void TRF797x_setup(void) {
	RFSPI::init();

	waitms(5);

	// Initialize Radio GPIOs
	TRF_DISABLE()
	;
	TRF_ENABLESET()
	;
	TRF_ENABLE()
	;

	//
	// Enable an interrupt Low to High transition for the IRQ pin on the TRF7970A
	//
	IRQ_PIN_SET()
	;
	IRQ_INT_ON()
	;
	IRQ_EDGE_SET()
	;
	IRQ_CLR()
	;

	TRF797x_idleMode();
}

//===============================================================
// NAME: void Trf796xDirectCommand (uint8_t *pui8Value)
//
// BRIEF: Is used to transmit a Direct Command to TRF796x.
//
// INPUTS:
//    Parameters:
//        uint8_t        *pui8Value        Direct Command
//
// OUTPUTS:
//
// PROCESS:    [1] transmit Direct Command
//
// CHANGE:
// DATE          WHO    DETAIL
// 24Nov2010    RP    Original Code
//===============================================================

