filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/nfclink/nfclinklib/Source/RFID/RFID.cpp
void TRF797x_directCommand(uint8_t ui8Command) {
	uint8_t ui8TxBuff[2];

	if (SPIMODE) // SPI mode given by jumper setting
	{
		if (ui8Command == TRF79X0_RESET_FIFO_CMD) {
			//
			// Reset FIFO CMD + Dummy byte
			//
			ui8TxBuff[0] = TRF79X0_RESET_FIFO_CMD | BIT7;
			ui8TxBuff[1] = 0x00;
			RFSPI::rawWrite(ui8TxBuff, 2);
		} else {
			ui8TxBuff[0] = ui8Command | BIT7;
			RFSPI::rawWrite(ui8TxBuff, 1);
		}
	}

}

//===============================================================
// NAME: void TRF797xRawWrite (uint8_t *pui8Value, uint8_t length)
//
// BRIEF: Is used to write direct to the TRF797x.
//
// INPUTS:
//	Parameters:
//		uint8_t		*pui8Value		raw data
//		uint8_t		length		number of data bytes
//
// OUTPUTS:
//
// PROCESS:	[1] send raw data to TRF797x
//
// CHANGE:
// DATE  		WHO	DETAIL
// 24Nov2010	RP	Original Code
//===============================================================
void TRF797x_rawWrite(uint8_t *pui8Payload, uint8_t ui8Length) {
	if (SPIMODE) // SPI mode given by jumper setting
	{
		RFSPI::rawWrite(pui8Payload, ui8Length);
	} else // parallel mode
	{
//		ParallelRawWrite(pui8Value, length);
	}
}

//===============================================================
// NAME: void TRF797xReadSingle (uint8_t *pui8Value, uint8_t number)
//
// BRIEF: Is used to read specified TRF797x registers.
//
// INPUTS:
//	Parameters:
//		uint8_t		*pui8Value		addresses of the registers
//		uint8_t		number		number of the registers
//
// OUTPUTS:
//
// PROCESS:	[1] read registers
//			[2] write contents to *pui8Value
//
// CHANGE:
// DATE  		WHO	DETAIL
// 24Nov2010	RP	Original Code
//===============================================================

void TRF797x_readSingle(uint8_t *pui8Value, uint8_t ui8Register) {
	if (SPIMODE) // SPI mode given by jumper setting
	{
		RFSPI::read(ui8Register, pui8Value);
	} else // parallel mode
	{
//		ParallelReadSingle(pui8Value, number);
	}
}

//===============================================================
// NAME: void TRF797xReadCont (uint8_t *pui8Value, uint8_t length)
//
// BRIEF: Is used to read a specified number of TRF797x registers
// from a specified address upwards.
//
// INPUTS:
//	Parameters:
//		uint8_t		*pui8Value		address of first register
//		uint8_t		length		number of registers
//
// OUTPUTS:
//
// PROCESS:	[1] read registers
//			[2] write contents to *pui8Value
//
// CHANGE:
// DATE  		WHO	DETAIL
// 24Nov2010	RP	Original Code
//===============================================================

void TRF797x_readCont(uint8_t *pui8Value, uint8_t ui8Register,
		uint8_t ui8Length) {
	if (SPIMODE) // SPI mode given by jumper setting
	{
		RFSPI::readCont(ui8Register, pui8Value, ui8Length);
	} else // parallel mode
	{
//		ParallelReadCont(pui8Value, length);
	}
}

//===============================================================
// NAME: void TRF797xWriteSingle (uint8_t ui8Value, uint8_t ui8Length)
//
// BRIEF: Is used to write to specified reader chip registers.
//
// INPUTS:
//	uint8_t	*pui8Value	addresses of the registers followed by the
//					contents to write
//	uint8_t	length	number of registers * 2
//
// OUTPUTS:
//
// PROCESS:	[1] write to the registers
//
// CHANGE:
// DATE  		WHO	DETAIL
// 24Nov2010	RP	Original Code
//===============================================================

void TRF797x_writeSingle(uint8_t ui8Value, uint8_t ui8Register) {
	if (SPIMODE) // SPI mode given by jumper setting
	{
		RFSPI::write(ui8Register, &ui8Value);
	} else // parallel mode
	{
//		ParallelWriteSingle(pui8Value, length);
	}
}

//===============================================================
// NAME: void SpiWriteCont (uint8_t *pui8Value, uint8_t ui8Length)
//
// BRIEF: Is used to write to a specific number of reader chip
// registers from a specific address upwards.
//
// INPUTS:
//	uint8_t	*pui8Value	address of first register followed by the
//					contents to write
//	uint8_t	length	number of registers + 1
//
// OUTPUTS:
//
// PROCESS:	[1] write to the registers
//
// CHANGE:
// DATE  		WHO	DETAIL
//===============================================================

void TRF797x_writeCont(uint8_t *pui8Value, uint8_t ui8Register,
		uint8_t ui8Length) {
	if (SPIMODE) // SPI mode given by jumper setting
	{
		RFSPI::writeCont(ui8Register, pui8Value, ui8Length);
	} else // parallel mode
	{
//		ParallelWriteCont(pui8Value, length);
	}
}

void TRF797x_resetFIFO(void) {
	TRF797x_directCommand(TRF79X0_RESET_FIFO_CMD);
}

void TRF797x_displayMode(void) {
	if (g_sTrf7970Status.eCurrentMode == TRF_INITIATOR_MODE) {
		GPIO::setRWMode(true);
		GPIO::setP2PTargetMode(false);
		GPIO::setCEMode(false);
	} else if (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE) {
		// Check if NFC mode is enabled
		if (g_bNfcTargetEnable == true)
//		if(g_sTrf7970Status.bNfcModeEnabled == 1)
				{
			GPIO::setRWMode(false);
			GPIO::setP2PTargetMode(true);
			GPIO::setCEMode(false);
		}
		// If is not NFC mode then it means is in Card Emulation
		else {
			GPIO::setRWMode(false);
			GPIO::setP2PTargetMode(false);
			GPIO::setCEMode(true);
		}
	} else {
		GPIO::setRWMode(false);
		GPIO::setP2PTargetMode(false);
		GPIO::setCEMode(false);
	}
}

/*
 * Reset TRF79x0 in current mode. (Needed for Target Mode to start polling for
 * supported modes and frequencies.)
 */
uint8_t TRF797x_resetMode(void) {
	if (g_sTrf7970Status.eCurrentMode == TRF_IDLE_MODE) {
		TRF797x_idleMode();
	} else if (g_sTrf7970Status.eCurrentMode == TRF_INITIATOR_MODE) {
		TRF797x_initiatorModeSetup(g_sTrf7970Status.sInitiatorMode,
				g_sTrf7970Status.sInitiatorPayloadFrequency);
	} else if (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE) {
		TRF797x_targetModeSetup(g_sTargetSupportedTechnologies,
				g_sTargetSupportedBitrates);
	} else
		return STATUS_FAIL_T;

	return OK;
}

uint8_t * TRF797x_getNfcBuffer(void) {
	return g_ui8FifoBuffer;
}

tTRF797x_Status TRF797x_getStatus(void) {
	return g_sTrf7970Status;
}

void TRF797x_setAutoSdd(uint8_t * pui8TargetId, uint8_t ui8IdLength,
		bool bNfcDep, bool bIsoDep) {
	uint8_t ui8Temp;

	// UID Length Must be 4,7,or 10
	if (ui8IdLength == 0x04 || ui8IdLength == 0x07 || ui8IdLength == 0x0A) {
		// Check if is different than current DEP support
		if (g_bNfcDepSupport != bNfcDep || g_bIsoDepSuport != bIsoDep
				|| g_ui8IdLength != ui8IdLength) {
			g_ui8IdLength = ui8IdLength;
			// Copy the UID
			for (ui8Temp = 0; ui8Temp < ui8IdLength; ui8Temp++) {
				g_ui8TargetId[ui8Temp] = pui8TargetId[ui8Temp];
			}
			g_bNfcDepSupport = bNfcDep;
			g_bIsoDepSuport = bIsoDep;

			TRF797x_initAutoSdd();
		}
	}
}

void TRF797x_initAutoSdd(void) {
	if (g_ui8IdLength > 0) {
		if (g_bIsoDepSuport == true)
			// Indicate Layer 4 Compliance
			TRF797x_writeSingle(0x01, TRF79X0_ISO14443B_OPTIONS_REG);
		if (g_bNfcDepSupport == true)
			// Not supported

			if (g_ui8IdLength == 0x04) {
				// Auto SDD - Single UID
				TRF797x_writeSingle(0x27, TRF79X0_NFC_TARGET_LEVEL_REG);
				TRF797x_writeCont(g_ui8TargetId, TRF79X0_NFC_ID_REG, 0x04);
			} else if (g_ui8IdLength == 0x07) {
				// Auto SDD - Double UID
				TRF797x_writeSingle(0x67, TRF79X0_NFC_TARGET_LEVEL_REG);
				TRF797x_writeCont(g_ui8TargetId, TRF79X0_NFC_ID_REG, 0x07);
			} else if (g_ui8IdLength == 0x0A) {
				// Auto SDD - Tripple UID
				TRF797x_writeSingle(0xA7, TRF79X0_NFC_TARGET_LEVEL_REG);
				TRF797x_writeCont(g_ui8TargetId, TRF79X0_NFC_ID_REG, 0x0A);
			}
	}
}

