filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/nfclink/nfclinklib/Source/RFID/RFID.cpp
void TRF797x_disableAutoSdd(void) {
	g_bIsoDepSuport = false;
	g_bIsoDepSuport = false;
	g_ui8IdLength = 0;
}

void TRF797x_setTargetSelect(bool bTargetStatus) {

	if (bTargetStatus == true) {
		P4DIR |= BIT6;
		P4OUT |= BIT6;
	} else {
		P4DIR |= BIT6;
		P4OUT &= ~BIT6;
	}

	g_sTrf7970Status.bTargetSelected = bTargetStatus;
}

void TRF797x_setNfcMode(bool bNfcMode) {
	g_sTrf7970Status.bNfcModeEnabled = bNfcMode;
}

/*
 * Writes payload to the FIFO register.
 */
uint8_t TRF797x_writeFIFO(uint8_t *pui8Payload, tTRF797x_CRC eCRCBit,
		uint8_t ui8Length, uint8_t ui8BrokenBits) {
	uint8_t ui8Status = STATUS_SUCCESS_T;
	tTRF797x_IRQFlag sIrqStatusFlag = IRQ_STATUS_IDLE;
	uint8_t ui8RemainingBytes = 0;
	uint8_t ui8FiFoStatusLength = 0;
	uint8_t ui8PayloadLength = 0;
	uint8_t ui8TimeOutCounter = 0;
	uint8_t ui8IrqBuffer[2];

	// Ensure the IRQ line is low before sending out a packet
//	TRF797x_irqHandler(0);
	if (IRQ_IS_SET())
	{
		TRF797x_readSingle(ui8IrqBuffer, TRF79X0_IRQ_STATUS_REG);
	}

	if (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE) {
		// Enable the field for active communication
		if (g_sTrf7970Status.sTargetMode.bits.bActiveTypeA == 1
				|| g_sTrf7970Status.sTargetMode.bits.bActiveTypeF == 1) {
			waitus(200);
		}
	} else if (g_sTrf7970Status.eCurrentMode == TRF_INITIATOR_MODE) {
		// Enable the field for active communication
		if (g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeA == 1
				|| g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeF == 1) {
			TRF797x_switchInitiatorBaudRate(
					g_sTrf7970Status.sInitiatorPayloadFrequency, true);
			waitus(200);
		}
	}

	if (ui8Status != STATUS_FAIL_T) {
		// Check if the Total Packet Length is greater than 127, if so we have to fragment
		// the packet with the first fragment including 127 bytes.
		if (ui8Length > 127) {
			ui8PayloadLength = 127;
		} else {
			ui8PayloadLength = ui8Length;
		}

		// Calculate remaining bytes to be sent.
		ui8RemainingBytes = ui8Length - ui8PayloadLength;

		// Send 1st Fragment of the packet.
		RFSPI::writePacket(pui8Payload, (uint8_t) eCRCBit, ui8Length,
				ui8PayloadLength, true, ui8BrokenBits);

		// Wait until TX is complete
		while (sIrqStatusFlag != IRQ_STATUS_TX_COMPLETE) {
			if (RFID::callback()) {
				return STATUS_FAIL_T;
			}

			// Workaround for Type A commands - check the IRQ within 7 mS to refill FIFO
			if (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE
					&& (g_sTrf7970Status.sTargetMode.bits.bPassiveTypeA == 1)
					&& ui8Length > 127) {
				sIrqStatusFlag = TRF797x_irqHandler(7);
				ui8TimeOutCounter = ui8TimeOutCounter + 7;
			}
			// Workaround for Type F commands - check the IRQ within 1 mS to refill FIFO
			else if (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE
					&& (g_sTrf7970Status.sTargetMode.bits.bPassiveTypeF == 1
							|| g_sTrf7970Status.sTargetMode.bits.bActiveTypeF
									== 1) && ui8Length > 127) {
				sIrqStatusFlag = TRF797x_irqHandler(5);
				ui8TimeOutCounter = ui8TimeOutCounter + 5;
			} else {
				sIrqStatusFlag = TRF797x_irqHandler(1);
				ui8TimeOutCounter++;
			}

			// Check if there was a Protocol_Error or if 40 mSec ( 128 bytes @ 26kb worst case scenario)
			if (sIrqStatusFlag == IRQ_STATUS_PROTOCOL_ERROR
					|| sIrqStatusFlag == IRQ_STATUS_NO_RESPONSE
					|| ui8TimeOutCounter > 40) {
				ui8Status = STATUS_FAIL_T;
				break;
			} else if (sIrqStatusFlag == IRQ_STATUS_TX_COMPLETE) {
				ui8Status = OK;
			} else if ((sIrqStatusFlag == IRQ_STATUS_FIFO_HIGH_OR_LOW
					|| sIrqStatusFlag == IRQ_STATUS_TIME_OUT)
					&& ui8RemainingBytes > 0) {
				ui8TimeOutCounter = 0;
				// Modify the pointer to point to the next address of data for payload larger than 127 bytes
				pui8Payload = pui8Payload + ui8PayloadLength;

				// Check how many bytes are inside the FIFO.
				TRF797x_readSingle(&ui8FiFoStatusLength,
						TRF79X0_FIFO_STATUS_REG);

				// Check if there are more remaining bytes than available spots on the TRF7970
				if (ui8RemainingBytes > (127 - ui8FiFoStatusLength)) {
					// If there are more bytes than available then payload length is the (127 - ui8FiFoStatusLength)
					ui8PayloadLength = (127 - ui8FiFoStatusLength);
				} else {
					ui8PayloadLength = ui8RemainingBytes;
				}

				// Update Remaining Bytes.
				ui8RemainingBytes = ui8RemainingBytes - ui8PayloadLength;

				RFSPI::writePacket(pui8Payload, (uint8_t) eCRCBit, ui8Length,
						ui8PayloadLength, false, 0x00);
			}
		}

		// Target Active Communication Handling.
		if (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE
				&& g_sTrf7970Status.sTargetMode.ui8byte != 0x00) {
			// Disable the field for active communication
			if (g_sTrf7970Status.sTargetMode.bits.bActiveTypeA == 1) {
				// Handle the RF Field turned on while exiting the send cmd.
				TRF797x_irqHandler(0);

				waitus(1);

				// Setup for passive target mode.
				TRF797x_writeSingle(0x21, TRF79X0_ISO_CONTROL_REG);
			} else if (g_sTrf7970Status.sTargetMode.bits.bActiveTypeF == 1) {
				// Handle the RF Field turned on while exiting the send cmd.
				TRF797x_irqHandler(0);

				waitus(1);

				// Setup for passive target mode.
				TRF797x_writeSingle(0x21, TRF79X0_ISO_CONTROL_REG);
			}

		}
		// Initiator Active Communication Handling.
		else if (g_sTrf7970Status.eCurrentMode == TRF_INITIATOR_MODE) {
			// Enable the field for active communication
			if (g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeA == 1) {
				// Handle the RF Field turned on while exiting the send cmd.
				TRF797x_irqHandler(0);

				waitus(1);

				// Setup for passive target mode.
				TRF797x_writeSingle(0x21, TRF79X0_ISO_CONTROL_REG);
			} else if (g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeF == 1) {
				// Handle the RF Field turned on while exiting the send cmd.
				TRF797x_irqHandler(0);

				waitus(100);

				// Setup for passive target mode.
				TRF797x_writeSingle(0x21, TRF79X0_ISO_CONTROL_REG);
			}
		}
	}

	return ui8Status;
}

