filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/nfclink/nfclinklib/Source/RFID/RFID.cpp
/*
 * IRQ Handler.
 */
tTRF797x_IRQFlag TRF797x_irqHandler(uint16_t ui16TimeOut) {
	tTRF797x_IRQFlag eIrqStatusFlag = IRQ_STATUS_IDLE;

	uint8_t ui8IrqBuffer[2];
	uint8_t ui8TargetProtocol[2];
	uint8_t ui8FifoStatusLength;
	uint8_t ui8FifoIndex = 0;
//	uint8_t ui8PacketLength = 0;

	bool bRfidModeEnabled = false;
	bool bNfcModeEnabled = false;

	static Timer txTimer;

	uint16_t ui16ElapsedTimeMs = 0;
	uint16_t ui16TimeDelayValue = 0;

	if (IRQ_IS_SET())
		g_ui8IrqFlag = 1;
	else {
		g_ui8IrqFlag = 0;
		if (ui16TimeOut == 0)
			return eIrqStatusFlag;
	}

	//
	// Check if the IRQ flag has been set
	//
	while (IRQ_IS_SET() == 0x00 && ui16ElapsedTimeMs != ui16TimeOut) {
		if (txTimer.iselapsed()) {
			if (RFID::callbackFunction()) {
				__no_operation();
				break;
			}
			ui16ElapsedTimeMs += ui16TimeDelayValue;
			if ((ui16TimeOut - ui16ElapsedTimeMs) > 100) {
				ui16TimeDelayValue = 100;
			} else if (ui16TimeOut != ui16ElapsedTimeMs)
				ui16TimeDelayValue = ui16TimeOut - ui16ElapsedTimeMs;
			txTimer.Start(ui16TimeDelayValue);
		}
	}

	//
	// Disable Timer
	//
	txTimer.Stop();

	// Check for RFID Mode
	if ((g_sTrf7970Status.eCurrentMode == TRF_INITIATOR_MODE
			&& (g_sTrf7970Status.sInitiatorMode.bits.bPassive15693 == 1
					|| g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeA == 1
					|| g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeB == 1
					|| g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeF == 1))) {
		bRfidModeEnabled = true;
	} else if (g_sTrf7970Status.eCurrentMode != TRF_IDLE_MODE) {
		bNfcModeEnabled = true;
	}

	if (g_ui8IrqFlag == 0x00 && ui16TimeOut > 0) {
		eIrqStatusFlag = IRQ_STATUS_TIME_OUT;
	} else {

		g_ui8IrqFlag = 0;

		if (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE) {
			//
			// Read Target Protocol
			//
			TRF797x_readCont(ui8TargetProtocol, TRF79X0_NFC_TARGET_PROTOCOL_REG,
					2);
		}

		//
		// Read IRQ Register
		//
		TRF797x_readSingle(ui8IrqBuffer, TRF79X0_IRQ_STATUS_REG);

		// RF Field for Target Modes
		if (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE) {
			if ((ui8TargetProtocol[0] & 0x80) == 0x80) {
				g_sTrf7970Status.bRfFieldOn = true;
			} else if (g_sTrf7970Status.bRfFieldOn) {
				g_sTrf7970Status.bRfFieldOn = false;
			}
		} else if (g_sTrf7970Status.eCurrentMode != TRF_TARGET_MODE) {
			g_sTrf7970Status.bRfFieldOn = false;
		}

		//
		// FIFO_IRQ_Handler
		//
		if (ui8IrqBuffer[0] & IRQ_STATUS_FIFO_HIGH_OR_LOW) {
			if (ui8IrqBuffer[0] & IRQ_STATUS_RX_COMPLETE) {
				g_sTrf7970Status.ui8FifoBytesReceived = 0;
				//
				// Read the FIFO status and FIFO into g_nfc_buffer
				//
				TRF797x_readSingle(&ui8FifoStatusLength,
						TRF79X0_FIFO_STATUS_REG);

				ui8FifoIndex = 0;

				while ((g_sTrf7970Status.ui8FifoBytesReceived
						+ ui8FifoStatusLength) <= NFC_FIFO_SIZE
						&& eIrqStatusFlag == IRQ_STATUS_IDLE) {

					// Update the received bytes
					g_sTrf7970Status.ui8FifoBytesReceived +=
							ui8FifoStatusLength;

//					// Check if the packet has been received completely.
//					if(ui8PacketLength == g_sTrf7970Status.ui8FifoBytesReceived &&
//						g_sTrf7970Status.bNfcModeEnabled == true)
//					{
//						// Handle Active communication TADT Required Delay
//						if(g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE &&
//							 (g_sTrf7970Status.sTargetMode.bits.bActiveTypeF == 1 ||
//							  g_sTrf7970Status.sTargetMode.bits.bActiveTypeA == 1))
//						{
//							while(TRF797x_checkField(EXTERNAL_RSSI) != 0x00);
//							TRF797x_switchTargetBaudRate(g_sTrf7970Status.sTargetPayloadFrequency,true);
//							TRF797x_setField(EXT_FIELD_ON);
//						}
//						else if (g_sTrf7970Status.eCurrentMode == TRF_INITIATOR_MODE &&
//								 (g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeF == 1 ||
//								  g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeA == 1))
//						{
//							while(TRF797x_checkField(EXTERNAL_RSSI) != 0x00);
//							TRF797x_switchInitiatorBaudRate(g_sTrf7970Status.sInitiatorPayloadFrequency,true);
//							TRF797x_setField(EXT_FIELD_ON);
//						}
//						TRF797x_readCont(&g_ui8FifoBuffer[ui8FifoIndex],TRF79X0_FIFO_REG, ui8FifoStatusLength);
//						eIrqStatusFlag = IRQ_STATUS_RX_COMPLETE;
//						break;
//					}

					if (ui8FifoStatusLength > 0) {
						//
						// Read the FIFO Data
						//
						TRF797x_readCont(&g_ui8FifoBuffer[ui8FifoIndex],
								TRF79X0_FIFO_REG, ui8FifoStatusLength);

						// Update fifo_index
						ui8FifoIndex = ui8FifoIndex + ui8FifoStatusLength;
					}

					//
					// Re-Read the FIFO status to check if we are still in the process of receiving
					//
					TRF797x_readSingle(&ui8FifoStatusLength,
							TRF79X0_FIFO_STATUS_REG);

					// If there are no more bytes inside the FIFO
					if ((ui8FifoStatusLength & 0x7F) == 0x00) {
						eIrqStatusFlag = IRQ_STATUS_RX_COMPLETE;
						break;
					} else {
						//
						// Initialize a 1 mS timeout
						//
						if (g_sTrf7970Status.eCurrentMode == TRF_INITIATOR_MODE
								&& (g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeA
										== 1
										|| g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeA
												== 1)) {
//							// If the IRQ is set, do not read out the data yet (workaround for Passive Type A)
//							if (IRQ_IS_SET())
//							{
//								TRF797x_readCont(ui8IrqBuffer, TRF79X0_IRQ_STATUS_REG, 2);
//							}
							g_ui8IrqFlag = 0;
							ui16TimeOut = 7;
						} else if (g_sTrf7970Status.eCurrentMode
								== TRF_TARGET_MODE
								&& (g_sTrf7970Status.sTargetMode.bits.bPassiveTypeA
										== 1
										|| g_sTrf7970Status.sTargetMode.bits.bActiveTypeA
												== 1)) {
							ui16TimeOut = 7;
						} else {

							ui16TimeOut = 7;
						}

						if (!IRQ_IS_SET())
							g_ui8IrqFlag = 0;

						// Clear ui16TimeDelayValue
						ui16TimeDelayValue = 0;
						ui16ElapsedTimeMs = 0;

						while (g_ui8IrqFlag == 0x00
								&& ui16ElapsedTimeMs != ui16TimeOut) {
							if (txTimer.iselapsed()) {
								if (RFID::callbackFunction()) {
									__no_operation();
									break;
								}
								ui16ElapsedTimeMs += ui16TimeDelayValue;
								if ((ui16TimeOut - ui16ElapsedTimeMs) > 100) {
									ui16TimeDelayValue = 100;
								} else if (ui16TimeOut != ui16ElapsedTimeMs)
									ui16TimeDelayValue = ui16TimeOut
											- ui16ElapsedTimeMs;
								txTimer.Start(ui16TimeDelayValue);
							}
						}

						//
						// Disable Timer
						//
						txTimer.Stop();
					}

