filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/nfclink/nfclinklib/Source/RFID/RFID.cpp
//					// Check for packet length for P2P
//					if( (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE &&
//							(g_sTrf7970Status.sTargetMode.ui8byte == 0x00 ||
//							 g_sTrf7970Status.sTargetMode.bits.bPassiveTypeF == 1 ||
//							 g_sTrf7970Status.sTargetMode.bits.bActiveTypeF == 1 ||
//							 g_sTrf7970Status.sTargetMode.bits.bPassiveTypeA == 1 ||
//							 g_sTrf7970Status.sTargetMode.bits.bActiveTypeA == 1))
//							 && g_sTrf7970Status.bNfcModeEnabled == true)
//					{
//						if( (ui8TargetProtocol[0] == 0xC0 ||
//								((ui8TargetProtocol[0] & 0x09) == 0x09))
//								&& g_ui8FifoBuffer[0] == 0xF0)
//						{
//							ui8PacketLength = g_ui8FifoBuffer[1]+1;
//						}
//						else if(((ui8TargetProtocol[0] & 0x12) == 0x12) ||
//								((ui8TargetProtocol[0] & 0x13) == 0x13))
//						{
//							ui8PacketLength = g_ui8FifoBuffer[0];
//						}
//					}
//					else if ((g_sTrf7970Status.eCurrentMode == TRF_INITIATOR_MODE &&
//								(g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeF == 1 ||
//								 g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeF == 1))
//							 && g_sTrf7970Status.bNfcModeEnabled == true)
//					{
//						ui8PacketLength = g_ui8FifoBuffer[0];
//					}
//					else if(g_sTrf7970Status.eCurrentMode == TRF_INITIATOR_MODE &&
//							(g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeA == 1 ||
//									g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeA == 1)
//							&& g_sTrf7970Status.bNfcModeEnabled == true)
//					{
//						if(g_ui8FifoBuffer[0] == 0xF0)
//						{
//							ui8PacketLength = g_ui8FifoBuffer[1]+1;
//						}
//					}

					TRF797x_readCont(ui8IrqBuffer, TRF79X0_IRQ_STATUS_REG, 2);

					//
					// Read the FIFO status and FIFO into g_nfc_buffer
					//
					TRF797x_readSingle(&ui8FifoStatusLength,
							TRF79X0_FIFO_STATUS_REG);

					// Mask off bit 7.
					ui8FifoStatusLength &= 0x7F;
				}

				if (eIrqStatusFlag != IRQ_STATUS_RX_COMPLETE) {
					eIrqStatusFlag = IRQ_STATUS_PROTOCOL_ERROR;
				} else if (IRQ_IS_SET()) {
					TRF797x_readCont(ui8IrqBuffer, TRF79X0_IRQ_STATUS_REG, 2);
				}

				if (eIrqStatusFlag == IRQ_STATUS_RX_COMPLETE) {
					if (g_sTrf7970Status.eCurrentMode == TRF_INITIATOR_MODE
							|| ((g_sTrf7970Status.eCurrentMode
									== TRF_TARGET_MODE)
									&& (g_sTrf7970Status.bTargetSelected == true)))
						RF_WriteMailBox(g_ui8FifoBuffer,
								g_sTrf7970Status.ui8FifoBytesReceived);
				}

			} else if (ui8IrqBuffer[0] & IRQ_STATUS_TX_COMPLETE) {
				//
				// Read the FIFO status and FIFO into g_nfc_buffer
				//
				TRF797x_readSingle(&ui8FifoStatusLength,
						TRF79X0_FIFO_STATUS_REG);

				if (ui8FifoStatusLength == 0x00) {
					eIrqStatusFlag = IRQ_STATUS_TX_COMPLETE;
				} else {
					eIrqStatusFlag = IRQ_STATUS_FIFO_HIGH_OR_LOW;
				}

			}
			// RX Complete
		} else if (ui8IrqBuffer[0] & IRQ_STATUS_RX_COMPLETE) {

			if (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE) {
				g_sTrf7970Status.bRfFieldOn = true;
				if (g_sTrf7970Status.bTargetSelected == true) {
					//
					// Register 0Fh. RSSI Register
					//
					TRF797x_readSingle(&g_sTrf7970Status.ui8InternalRssi,
							TRF79X0_RSSI_LEVEL_REG);
				}
			}
			// Initiator Mode
			else {
				//
				// Register 0Fh. RSSI Register
				//
				TRF797x_readSingle(&g_sTrf7970Status.ui8InternalRssi,
						TRF79X0_RSSI_LEVEL_REG);
			}

			//
			// Read the FIFO status and FIFO into g_nfc_buffer
			//
			TRF797x_readSingle(&ui8FifoStatusLength, TRF79X0_FIFO_STATUS_REG);

			// Handle Active communication TADT Required Delay
			if (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE
					&& (g_sTrf7970Status.sTargetMode.bits.bActiveTypeF == 1
							|| g_sTrf7970Status.sTargetMode.bits.bActiveTypeA
									== 1 ||
							// Check if first polling command is greater than 20 bytes
							(g_sTrf7970Status.sTargetMode.ui8byte == 0x00
									&& ui8FifoStatusLength > 20
									&& (g_sTargetSupportedTechnologies.bits.bActiveTypeA
											== 1
											|| g_sTargetSupportedTechnologies.bits.bActiveTypeF
													== 1)))) {
				// Wait until RF Field is disabled.
				while (TRF797x_checkField(EXTERNAL_RSSI) != 0x00)
					;
				if (g_sTrf7970Status.sTargetMode.ui8byte == 0x00) {
					// Change the ISO Control Register to RFID Mode to ensure RF Field will be enabled.
					TRF797x_writeSingle(0x08, TRF79X0_ISO_CONTROL_REG);
				} else {
					TRF797x_switchTargetBaudRate(
							g_sTrf7970Status.sTargetPayloadFrequency, true);
				}
				TRF797x_setField(EXT_FIELD_ON);
			} else if (g_sTrf7970Status.eCurrentMode == TRF_INITIATOR_MODE
					&& (g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeF == 1
							|| g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeA
									== 1)) {
				while (TRF797x_checkField(EXTERNAL_RSSI) != 0x00)
					;
				TRF797x_switchInitiatorBaudRate(
						g_sTrf7970Status.sInitiatorPayloadFrequency, true);
				TRF797x_setField(EXT_FIELD_ON);
			}

			// Check if the selected_mode corresponds to the command read in the command
			if ((g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE
					&& (g_sTrf7970Status.sTargetMode.ui8byte == 0x00
							|| (g_sTrf7970Status.sTargetMode.bits.bPassiveTypeF
									== 1
									&& ui8TargetProtocol[0]
											& TRF79X0_NFC_TARGET_PROTOCOL_FELICA)
							|| (g_sTrf7970Status.sTargetMode.bits.bActiveTypeF
									== 1
									&& ui8TargetProtocol[0]
											& TRF79X0_NFC_TARGET_PROTOCOL_FELICA)
							|| (g_sTrf7970Status.sTargetMode.bits.bPassiveTypeA
									== 1)
							|| (g_sTrf7970Status.sTargetMode.bits.bPassiveTypeB
									== 1
									&& ui8TargetProtocol[0]
											& TRF79X0_NFC_TARGET_PROTOCOL_ISO14443B)
							|| (g_sTrf7970Status.sTargetMode.bits.bActiveTypeA
									== 1)))
					|| g_sTrf7970Status.sInitiatorMode.bits.bPassive15693 == 1
					|| g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeA == 1
					|| g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeA == 1
					|| g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeB == 1
					|| g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeF == 1
					|| g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeF == 1)

					{
				// Read the data
				if (ui8FifoStatusLength > 0
						&& ((ui8FifoStatusLength & TRF79X0_FIFO_OVERFLOW)
								!= TRF79X0_FIFO_OVERFLOW)) {
					//
					// Read the FIFO Data
					//
					TRF797x_readCont(g_ui8FifoBuffer, TRF79X0_FIFO_REG,
							ui8FifoStatusLength);

					g_sTrf7970Status.ui8FifoBytesReceived = ui8FifoStatusLength;
				} else {
					TRF797x_resetMode();
					return IRQ_STATUS_IDLE;
				}

