filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/nfclink/nfclinklib/Source/RFID/RFID.cpp
				// Target Mode Listening for multiple protocols
				if (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE) {
					// Target Has not been activated
					if (g_sTrf7970Status.sTargetPayloadFrequency.ui16word
							== 0x0000) {
						switch (ui8TargetProtocol[0]
								& TRF79X0_NFC_TARGET_PROTOCOL_KBPS_MASK) {
						case TRF79X0_NFC_TARGET_PROTOCOL_106KBPS:
							g_sTrf7970Status.sTargetPayloadFrequency.bits.b106kpbs =
									1;
							break;
						case TRF79X0_NFC_TARGET_PROTOCOL_212KBPS:
							g_sTrf7970Status.sTargetPayloadFrequency.bits.b212kpbs =
									1;
							break;
						case TRF79X0_NFC_TARGET_PROTOCOL_424KBPS:
							g_sTrf7970Status.sTargetPayloadFrequency.bits.b424kpbs =
									1;
							break;
						default:
							// Handle Type A Case
							// Check for  SENS_REQ or  ATR_REQ
							if (ui8FifoStatusLength == 1
									|| (ui8FifoStatusLength
											== (g_ui8FifoBuffer[1] + 1))) {
								g_sTrf7970Status.sTargetPayloadFrequency.bits.b106kpbs =
										1;
							}

							break;
						}

						if (TRF797x_targetInitialize() != OK) {
							eIrqStatusFlag = IRQ_STATUS_IDLE;
							TRF797x_resetMode();
						} else {
							if (g_sTrf7970Status.bTargetSelected == false) {
								eIrqStatusFlag = IRQ_STATUS_IDLE;
								RF_anticollisionProcess(g_ui8FifoBuffer,
										g_sTrf7970Status.ui8FifoBytesReceived);
							} else {
								eIrqStatusFlag = IRQ_STATUS_RX_COMPLETE;
							}
						}
					} else {
						switch (ui8TargetProtocol[0]
								& TRF79X0_NFC_TARGET_PROTOCOL_KBPS_MASK) {
						case TRF79X0_NFC_TARGET_PROTOCOL_106KBPS:
							if (g_sTrf7970Status.sTargetPayloadFrequency.bits.b106kpbs
									!= 1)
								eIrqStatusFlag = IRQ_STATUS_PROTOCOL_ERROR;
							break;
						case TRF79X0_NFC_TARGET_PROTOCOL_212KBPS:
							if (g_sTrf7970Status.sTargetPayloadFrequency.bits.b212kpbs
									!= 1)
								eIrqStatusFlag = IRQ_STATUS_PROTOCOL_ERROR;
							break;
						case TRF79X0_NFC_TARGET_PROTOCOL_424KBPS:
							if (g_sTrf7970Status.sTargetPayloadFrequency.bits.b424kpbs
									!= 1)
								eIrqStatusFlag = IRQ_STATUS_PROTOCOL_ERROR;
							break;
						default:
							// Handle Type A Case
							if (ui8TargetProtocol[0] == 0xC0) {
								if (g_sTrf7970Status.sTargetPayloadFrequency.bits.b106kpbs
										!= 1)
									eIrqStatusFlag = IRQ_STATUS_PROTOCOL_ERROR;
							}

							break;
						}

						if (eIrqStatusFlag != IRQ_STATUS_PROTOCOL_ERROR) {
							if (g_sTrf7970Status.bTargetSelected == false) {
								RF_anticollisionProcess(g_ui8FifoBuffer,
										g_sTrf7970Status.ui8FifoBytesReceived);
							} else {
								eIrqStatusFlag = IRQ_STATUS_RX_COMPLETE;
							}
						}
					}

				}
				// Initiator Mode
				else {
					eIrqStatusFlag = IRQ_STATUS_RX_COMPLETE;
				}

				if (g_sTrf7970Status.eCurrentMode == TRF_INITIATOR_MODE
						|| ((g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE)
								&& (g_sTrf7970Status.bTargetSelected == true))) {
					// TODO Remove if statement to activate Card Emulation Type B
					if (eIrqStatusFlag == IRQ_STATUS_RX_COMPLETE) {
						RF_WriteMailBox(g_ui8FifoBuffer,
								g_sTrf7970Status.ui8FifoBytesReceived);
					}

				} else if (g_sTrf7970Status.sTargetMode.bits.bPassiveTypeB == 1
						&& g_ui8FifoBuffer[0] == 0xC2) {
					RF_anticollisionProcess(g_ui8FifoBuffer,
							g_sTrf7970Status.ui8FifoBytesReceived);
				}

			} else {
				if (ui8FifoStatusLength == 0) {
					eIrqStatusFlag = IRQ_STATUS_PROTOCOL_ERROR;
					TRF797x_resetMode();
				}
			}

		} else if (ui8IrqBuffer[0] & IRQ_STATUS_TX_COMPLETE) {

			if (ui8IrqBuffer[0] == IRQ_STATUS_TX_COMPLETE) {
				g_sTrf7970Status.bTxComplete = true;
				// Reset FIFO CMD + Dummy byte
				TRF797x_resetFIFO();

				eIrqStatusFlag = IRQ_STATUS_TX_COMPLETE;
			} else {
				// Read the FIFO status
				TRF797x_readSingle(&ui8FifoStatusLength,
						TRF79X0_FIFO_STATUS_REG);

				if (ui8FifoStatusLength == 0)
					eIrqStatusFlag = IRQ_STATUS_TX_COMPLETE;
			}
		}
		// Handle NFC remaining cases
		else if (bNfcModeEnabled) {
			if ((ui8IrqBuffer[0] & IRQ_STATUS_NFC_COLLISION_ERROR)
					|| (ui8IrqBuffer[0] & IRQ_STATUS_NFC_PROTOCOL_ERROR)) {
				if (g_sTrf7970Status.bTargetSelected)
					g_sTrf7970Status.bProtocolError = true;
				TRF797x_resetMode();
				eIrqStatusFlag = IRQ_STATUS_PROTOCOL_ERROR;
			} else if (ui8IrqBuffer[0] & IRQ_STATUS_NFC_RF_FIELD_CHANGE) {
				eIrqStatusFlag = IRQ_STATUS_RF_FIELD_CHANGE;
				if ((ui8TargetProtocol[0] & 0x80) != 0x80) {
					TRF797x_resetMode();
					eIrqStatusFlag = IRQ_STATUS_PROTOCOL_ERROR;
				}

				// Check RF Field when Active Initiator is enabled
				if (g_sTrf7970Status.eCurrentMode == TRF_INITIATOR_MODE
						&& (g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeF
								== 1
								|| g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeA
										== 1)) {
					TRF797x_readCont(ui8TargetProtocol,
							TRF79X0_NFC_TARGET_PROTOCOL_REG, 2);
				}

				if ((((ui8TargetProtocol[0] & 0x40) != 0x40)
						&& (ui8TargetProtocol[0] != 0x00))
						|| (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE
								&& g_sTrf7970Status.sTargetPayloadFrequency.ui16word
										== 0x0000
								&& (ui8TargetProtocol[0] == 0x00))) {
					// In the case we get this in the middle of a transfer
					TRF797x_resetMode();
				}
			} else if (ui8IrqBuffer[0] & IRQ_STATUS_NFC_SDD_COMPLETE) {
				g_sTrf7970Status.sTargetMode.bits.bPassiveTypeA = 1;
				g_sTrf7970Status.sTargetPayloadFrequency.bits.b106kpbs = 1;
				eIrqStatusFlag = IRQ_STATUS_SDD_COMPLETE;
				TRF797x_resetFIFO();
				// Disable Anti-collision Frames for 14443A.
				TRF797x_writeSingle(0x02, TRF79X0_SPECIAL_FUNC_1_REG);
			}
			// Handle RFID remaining cases
		} else if (bRfidModeEnabled) {
			if (ui8IrqBuffer[0] & IRQ_STATUS_RFID_COLLISION_ERROR
					|| ui8IrqBuffer[0] & IRQ_STATUS_RFID_FRAMING_OR_EOF_ERROR
					|| ui8IrqBuffer[0] & IRQ_STATUS_RFID_PARITY_ERROR
					|| ui8IrqBuffer[0] & IRQ_STATUS_RFID_CRC_ERROR) {
				TRF797x_resetMode();
				eIrqStatusFlag = IRQ_STATUS_PROTOCOL_ERROR;
			} else if (ui8IrqBuffer[0] == IRQ_STATUS_RFID_NO_RESPONSE_INT) {
				eIrqStatusFlag = IRQ_STATUS_NO_RESPONSE;
			}
		}
	}

	// RF Field for Target Modes
	if (g_sTrf7970Status.bRfFieldOn == true) {
		GPIO::setExtField(true);
	} else {
		GPIO::setExtField(false);
	}

