filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/nfclink/nfclinklib/Source/RFID/RFID.cpp
	// Reset Global Flags
	g_ui8IrqFlag = 0x00;

	return eIrqStatusFlag;
}

/*
 * Switch Target BaudRate.
 */
uint8_t TRF797x_switchTargetBaudRate(t_sTRF797x_Bitrate sTargetFrequency,
		bool bModifyRegister) {
	uint8_t ui8IsoControlReg;
	uint8_t ui8RetValue = STATUS_SUCCESS_T;

	//
	// Register 01h. ISO Control Reg
	//
	if (g_sTrf7970Status.sTargetMode.bits.bPassiveTypeA == 1) {
		if (sTargetFrequency.bits.b106kpbs == 1) {
			ui8IsoControlReg = 0x24;
		} else if (sTargetFrequency.bits.b212kpbs == 1) {
			// Clear Target Mode
			g_sTrf7970Status.sTargetMode.ui8byte = 0x00;
			// Set Active Type F
			g_sTrf7970Status.sTargetMode.bits.bPassiveTypeF = 1;
			ui8IsoControlReg = 0x22;
			g_sTrf7970Status.sTargetPayloadFrequency = sTargetFrequency;
		} else if (sTargetFrequency.bits.b424kpbs == 1) {
			// Clear Target Mode
			g_sTrf7970Status.sTargetMode.ui8byte = 0x00;
			// Set Active Type F
			g_sTrf7970Status.sTargetMode.bits.bPassiveTypeF = 1;
			ui8IsoControlReg = 0x23;
			g_sTrf7970Status.sTargetPayloadFrequency = sTargetFrequency;
		} else
			ui8RetValue = STATUS_FAIL_T;
	} else if (g_sTrf7970Status.sTargetMode.bits.bPassiveTypeB == 1) {
		if (sTargetFrequency.bits.b106kpbs == 1) {
			// Clear Target Mode
			g_sTrf7970Status.sTargetPayloadFrequency = sTargetFrequency;

			ui8IsoControlReg = 0x25;
		} else
			ui8RetValue = STATUS_FAIL_T;
	} else if (g_sTrf7970Status.sTargetMode.bits.bPassiveTypeF == 1) {
		if (sTargetFrequency.bits.b212kpbs == 1) {
			g_sTrf7970Status.sTargetMode.ui8byte = 0x00;
			g_sTrf7970Status.sTargetMode.bits.bPassiveTypeF = 1;
			g_sTrf7970Status.sTargetPayloadFrequency = sTargetFrequency;
			ui8IsoControlReg = 0x22;
		} else if (sTargetFrequency.bits.b424kpbs == 1) {
			g_sTrf7970Status.sTargetMode.ui8byte = 0x00;
			g_sTrf7970Status.sTargetMode.bits.bPassiveTypeF = 1;
			g_sTrf7970Status.sTargetPayloadFrequency = sTargetFrequency;
			ui8IsoControlReg = 0x23;
		} else
			ui8RetValue = STATUS_FAIL_T;
	} else if (g_sTrf7970Status.sTargetMode.bits.bActiveTypeA == 1) {
		if (sTargetFrequency.bits.b106kpbs == 1) {
			g_sTrf7970Status.sTargetPayloadFrequency = sTargetFrequency;
			ui8IsoControlReg = 0x08;
		} else if (sTargetFrequency.bits.b212kpbs == 1) {
			// Clear Target Mode
			g_sTrf7970Status.sTargetMode.ui8byte = 0x00;
			// Set Active Type F
			g_sTrf7970Status.sTargetMode.bits.bActiveTypeF = 1;
			ui8IsoControlReg = 0x32;
			g_sTrf7970Status.sTargetPayloadFrequency = sTargetFrequency;
		} else if (sTargetFrequency.bits.b424kpbs == 1) {
			// Clear Target Mode
			g_sTrf7970Status.sTargetMode.ui8byte = 0x00;
			// Set Active Type F
			g_sTrf7970Status.sTargetMode.bits.bActiveTypeF = 1;
			ui8IsoControlReg = 0x33;
			g_sTrf7970Status.sTargetPayloadFrequency = sTargetFrequency;
		} else
			ui8RetValue = STATUS_FAIL_T;
	} else if (g_sTrf7970Status.sTargetMode.bits.bActiveTypeF == 1) {
		if (sTargetFrequency.bits.b212kpbs == 1) {
			// Clear Target Mode
			g_sTrf7970Status.sTargetMode.ui8byte = 0x00;
			// Set Active Type F
			g_sTrf7970Status.sTargetMode.bits.bActiveTypeF = 1;
			ui8IsoControlReg = 0x32;
			g_sTrf7970Status.sTargetPayloadFrequency = sTargetFrequency;
		} else if (sTargetFrequency.bits.b424kpbs == 1) {
			// Clear Target Mode
			g_sTrf7970Status.sTargetMode.ui8byte = 0x00;
			// Set Active Type F
			g_sTrf7970Status.sTargetMode.bits.bActiveTypeF = 1;
			ui8IsoControlReg = 0x33;
			g_sTrf7970Status.sTargetPayloadFrequency = sTargetFrequency;
		} else
			ui8RetValue = STATUS_FAIL_T;
	} else {
		ui8RetValue = STATUS_FAIL_T;
	}

	if (ui8RetValue == OK) {
		g_sTrf7970Status.sTargetPayloadFrequency = sTargetFrequency;

		if (bModifyRegister == true) {
			TRF797x_writeSingle(ui8IsoControlReg, TRF79X0_ISO_CONTROL_REG);
		}
	}

	return ui8RetValue;
}

uint8_t TRF797x_incrementTargetBaudRate(t_sTRF797x_Bitrate sTargetFrequency) {
	uint8_t ui8RetValue = OK;

	if (g_sTrf7970Status.sTargetMode.bits.bPassiveTypeA == 1) {
		ui8RetValue = TRF797x_switchTargetBaudRate(sTargetFrequency, true);
	} else if (g_sTrf7970Status.sTargetMode.bits.bPassiveTypeB == 1) {
		ui8RetValue = TRF797x_switchTargetBaudRate(sTargetFrequency, true);
	} else if (g_sTrf7970Status.sTargetMode.bits.bPassiveTypeF == 1) {
		ui8RetValue = TRF797x_switchTargetBaudRate(sTargetFrequency, true);
	} else if (g_sTrf7970Status.sTargetMode.bits.bActiveTypeA == 1) {
		ui8RetValue = TRF797x_switchTargetBaudRate(sTargetFrequency, false);
	} else if (g_sTrf7970Status.sTargetMode.bits.bActiveTypeF == 1) {
		ui8RetValue = TRF797x_switchTargetBaudRate(sTargetFrequency, false);
	} else {
		ui8RetValue = STATUS_FAIL_T;
	}

	return ui8RetValue;
}

/*
 * Switch Initiator BaudRate.
 */
uint8_t TRF797x_switchInitiatorBaudRate(t_sTRF797x_Bitrate sInitiatorFrequency,
		bool bModifyRegister) {
	uint8_t ui8IsoControlReg;
	uint8_t ui8RetValue = STATUS_SUCCESS_T;
	g_sTrf7970Status.sInitiatorPayloadFrequency = sInitiatorFrequency;

	//
	// Register 01h. ISO Control Reg
	//
	if (g_sTrf7970Status.sInitiatorMode.bits.bPassive15693 == 1) {
		if (sInitiatorFrequency.bits.b6_62_kbps_1_out_4 == 1) {
			ui8IsoControlReg = 0x00;
		} else if (sInitiatorFrequency.bits.b6_62_kbps_1_out_256 == 1) {
			ui8IsoControlReg = 0x01;
		} else if (sInitiatorFrequency.bits.b26_48_kbps_1_out_4 == 1) {
			ui8IsoControlReg = 0x02;
		} else if (sInitiatorFrequency.bits.b26_48_kbps_1_out_256 == 1) {
			ui8IsoControlReg = 0x03;
		} else if (sInitiatorFrequency.bits.b6_67_kbps_1_out_4 == 1) {
			ui8IsoControlReg = 0x04;
		} else if (sInitiatorFrequency.bits.b6_67_kbps_1_out_256 == 1) {
			ui8IsoControlReg = 0x05;
		} else if (sInitiatorFrequency.bits.b26_69_kbps_1_out_4 == 1) {
			ui8IsoControlReg = 0x06;
		} else if (sInitiatorFrequency.bits.b26_69_kbps_1_out_256 == 1) {
			ui8IsoControlReg = 0x07;
		} else
			ui8RetValue = STATUS_FAIL_T;
	} else if (g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeA == 1) {
		if (sInitiatorFrequency.bits.b106kpbs == 1) {
			if (RF_getBitframe() == 0) {
				ui8IsoControlReg = 0x08;
			} else {
				ui8IsoControlReg = 0x88;
			}

		} else if (sInitiatorFrequency.bits.b212kpbs == 1) {

			if (g_sTrf7970Status.bNfcModeEnabled == false) {
				ui8IsoControlReg = 0x09;
			} else {
				// Clear Initiator Mode
				g_sTrf7970Status.sInitiatorMode.ui8byte = 0x00;
				// Set Passive Type F
				g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeF = 1;
				ui8IsoControlReg = 0x32;
			}
		} else if (sInitiatorFrequency.bits.b424kpbs == 1) {
			if (g_sTrf7970Status.bNfcModeEnabled == false) {
				ui8IsoControlReg = 0x0A;
			} else {
				// Clear Initiator Mode
				g_sTrf7970Status.sInitiatorMode.ui8byte = 0x00;
				// Set Passive Type F
				g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeF = 1;
				ui8IsoControlReg = 0x33;
			}
		} else if (sInitiatorFrequency.bits.b848kpbs == 1) {
			ui8IsoControlReg = 0x0B;
		}
	} else if (g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeA == 1) {
		if (sInitiatorFrequency.bits.b106kpbs == 1) {
			ui8IsoControlReg = 0x08;
		} else if (sInitiatorFrequency.bits.b212kpbs == 1) {

			if (g_sTrf7970Status.bNfcModeEnabled == false) {
				ui8IsoControlReg = 0x09;
			} else {
				// Clear Initiator Mode
				g_sTrf7970Status.sInitiatorMode.ui8byte = 0x00;
				// Set Passive Type F
				g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeF = 1;
				ui8IsoControlReg = 0x32;
			}
		} else if (sInitiatorFrequency.bits.b424kpbs == 1) {
			if (g_sTrf7970Status.bNfcModeEnabled == false) {
				ui8IsoControlReg = 0x0A;
			} else {
				// Clear Initiator Mode
				g_sTrf7970Status.sInitiatorMode.ui8byte = 0x00;
				// Set Passive Type F
				g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeF = 1;
				ui8IsoControlReg = 0x33;
			}
		}
	}

