filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/nfclink/nfclinklib/Source/RFID/RFID.cpp
	else if (g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeB == 1) {
		if (sInitiatorFrequency.bits.b106kpbs == 1) {
			ui8IsoControlReg = 0x0C;
		} else if (sInitiatorFrequency.bits.b212kpbs == 1) {
			ui8IsoControlReg = 0x0D;
		} else if (sInitiatorFrequency.bits.b424kpbs == 1) {
			ui8IsoControlReg = 0x0E;
		} else if (sInitiatorFrequency.bits.b848kpbs == 1) {
			ui8IsoControlReg = 0x0F;
		}
	} else if (g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeF == 1
			|| g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeF == 1) {
		if (sInitiatorFrequency.bits.b212kpbs == 1) {
			ui8IsoControlReg = 0x32;
			// In the MicroPross it looked as if the TRF was generating an extra when 0x1A was set.
//			ui8IsoControlReg = 0x1A;
		} else if (sInitiatorFrequency.bits.b424kpbs == 1) {
			ui8IsoControlReg = 0x33;
		}
	} else {
		ui8RetValue = STATUS_FAIL_T;
	}

	if (ui8RetValue == OK && bModifyRegister == true) {
		TRF797x_writeSingle(ui8IsoControlReg, TRF79X0_ISO_CONTROL_REG);
	}

	return ui8RetValue;
}

uint8_t TRF797x_incrementInitiatorBaudRate(
		t_sTRF797x_Bitrate sInitiatorFrequency) {
	uint8_t ui8RetValue = OK;
	//
	// Register 01h. ISO Control Reg
	//
	if (g_sTrf7970Status.sInitiatorMode.bits.bPassive15693 == 1) {
		ui8RetValue = TRF797x_switchInitiatorBaudRate(sInitiatorFrequency,
				true);
	} else if (g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeA == 1) {
		ui8RetValue = TRF797x_switchInitiatorBaudRate(sInitiatorFrequency,
				true);
	} else if (g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeA == 1) {
		ui8RetValue = TRF797x_switchInitiatorBaudRate(sInitiatorFrequency,
				true);
	} else if (g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeB == 1) {
		ui8RetValue = TRF797x_switchInitiatorBaudRate(sInitiatorFrequency,
				true);
	} else if (g_sTrf7970Status.sInitiatorMode.bits.bActiveTypeF == 1) {
		ui8RetValue = TRF797x_switchInitiatorBaudRate(sInitiatorFrequency,
				true);
	} else if (g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeF == 1) {
		ui8RetValue = TRF797x_switchInitiatorBaudRate(sInitiatorFrequency,
				true);
	} else {
		ui8RetValue = STATUS_FAIL_T;
	}

	return ui8RetValue;
}

/*
 * Get Collision Position if there was a collision.
 */
uint16_t TRF797x_getCollisionStatus(void) {
	uint16_t ui16CollisionStatus = 0x00;
	uint8_t ui8CollisionStatus = 0x00;

	TRF797x_readSingle(&ui8CollisionStatus, TRF79X0_COLLISION_POSITION_REG);

	ui16CollisionStatus = ui8CollisionStatus;

	TRF797x_readSingle(&ui8CollisionStatus, TRF79X0_IRQ_MASK_REG);

	// Mask Bit 7 and 6 ( Col 9 & Col 8)
	ui8CollisionStatus = ui8CollisionStatus & 0xC0;

	ui16CollisionStatus = (ui16CollisionStatus
			| ((uint16_t) ui8CollisionStatus << 8));

	return ui16CollisionStatus;
}

/*
 * Enable/Disable RF Field.
 */
uint8_t TRF797x_setField(tExtField eRfField) {
	if (eRfField == EXT_FIELD_ON) {
		//
		// Register 00h. Chip Status Control
		//
		TRF797x_writeSingle(
				TRF79X0_STATUS_CTRL_RF_ON | TRF79X0_CHIP_STATUS_CTRL_BYTE,
				TRF79X0_CHIP_STATUS_CTRL_REG);

		if(g_sTrf7970Status.sInitiatorMode.bits.bPassiveTypeB == 1)
		{
			// Add 15 ms to GTB
			waitms(15);
		}
	} else if (eRfField == EXT_FIELD_OFF) {
		//
		// Register 00h. Chip Status Control
		//
		TRF797x_writeSingle(
				(~TRF79X0_STATUS_CTRL_RF_ON) & TRF79X0_CHIP_STATUS_CTRL_BYTE,
				TRF79X0_CHIP_STATUS_CTRL_REG);
	} else
		return STATUS_FAIL_T;

	return OK;
}

/*
 * Checks the external field RSSI.
 */
uint8_t TRF797x_checkField(tRssiStatus eField) {
	uint8_t ui8RssiLevel;

	if (eField == INTERNAL_RSSI) {
		//
		// Transmitter On
		//
		TRF797x_setField(EXT_FIELD_ON);

		//
		// Register 00h. Chip Status Control
		//
		TRF797x_writeSingle(
				(TRF79X0_STATUS_CTRL_RF_ON | TRF79X0_STATUS_CTRL_RECEIVER_ON
						| TRF79X0_CHIP_STATUS_CTRL_BYTE),
				TRF79X0_CHIP_STATUS_CTRL_REG);

		//
		// Register 01h. ISO Control Reg
		//
		TRF797x_writeSingle(0x00, TRF79X0_ISO_CONTROL_REG);

		//
		// Test Internal RF Field
		//
		TRF797x_directCommand(TRF79X0_TEST_INTERNAL_RF_CMD);
	} else if (eField == EXTERNAL_RSSI) {
		//
		// Transmitter Off
		//
		TRF797x_setField(EXT_FIELD_OFF);

		//
		// Register 00h. Chip Status Control
		//
		TRF797x_writeSingle(
				(TRF79X0_STATUS_CTRL_RECEIVER_ON
						| TRF79X0_CHIP_STATUS_CTRL_BYTE),
				TRF79X0_CHIP_STATUS_CTRL_REG);

		//
		// Test External RF Field
		//
		TRF797x_directCommand(TRF79X0_TEST_EXTERNAL_RF_CMD);
	}

	waitus(50);

	//
	// Register 0Fh. RSSI Register
	//
	TRF797x_readSingle(&ui8RssiLevel, TRF79X0_RSSI_LEVEL_REG);

	return (ui8RssiLevel & 0x3F);
}

word TRF797x_checkExternalField(void) {
	uint8_t rx_buffer;
	word ret_val = OK;

	//
	// Soft Init Command
	//
	TRF797x_directCommand(TRF79X0_SOFT_INIT_CMD);

	//
	// Idle Command
	//
	TRF797x_directCommand(TRF79X0_IDLE_CMD);

	// Register 00h. Chip Status Control
	// RF output active, +5 V operation
	TRF797x_writeSingle(0x03, TRF79X0_CHIP_STATUS_CTRL_REG);

	// Check if there an external RF Field
	TRF797x_directCommand(TRF79X0_TEST_EXTERNAL_RF_CMD);

	// Delay 50 uS to latch the RSSI value to the RSSI register
	waitus(50);

	TRF797x_readSingle(&rx_buffer, TRF79X0_RSSI_LEVEL_REG);

	// If the External RF Field is 0x00, we continue else we return fail
	if ((rx_buffer & 0x3F) != 0x00) {
		// Register 00h. Chip Status Control
		// RF output de-activated, +5 V operation
		TRF797x_writeSingle(0x01, TRF79X0_CHIP_STATUS_CTRL_REG);
		ret_val = HF_FIELD_ERROR;
	} else {

		//
		// Register 09h. Modulator Control
		//
		// SYS_CLK (in this case 13.56 MHz) out optional, based on system req.
		TRF797x_writeSingle(0x00, TRF79X0_MODULATOR_CONTROL_REG);

		//
		// Register 0Bh. Regulator Control
		//
		TRF797x_writeSingle(0x01, TRF79X0_REGULATOR_CONTROL_REG);

		//
		// Register 14h. FIFO IRQ Level
		//
		// RX High = 96 bytes , TX Low = 32 bytes
		TRF797x_writeSingle(0x0F, TRF79X0_FIFO_IRQ_LEVEL);
	}

