filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/nfclink/nfclinklib/Source/RFID/RFID.cpp
	return ret_val;
}

/*
 * Initialize Idle Mode.
 */
uint8_t TRF797x_idleMode(void) {
	uint8_t ui8RxBuffer[2];
	uint8_t ui8RetryCounter = 0;

	// Reset Status Values
	g_sTrf7970Status.ui8FifoBytesReceived = 0x00;
	g_sTrf7970Status.bTxComplete = false;
	g_sTrf7970Status.bTargetSelected = false;
	g_sTrf7970Status.bRfFieldOn = false;
	g_sTrf7970Status.eCurrentMode = TRF_IDLE_MODE;
	g_sTrf7970Status.sTargetPayloadFrequency.ui16word = 0x0000;
	g_sTrf7970Status.sTargetMode.ui8byte = 0x00;
	g_sTrf7970Status.sInitiatorPayloadFrequency.ui16word = 0x0000;
	g_sTrf7970Status.sInitiatorMode.ui8byte = 0x00;
	g_sTrf7970Status.eIrqFlags = IRQ_STATUS_IDLE;
	g_sTrf7970Status.ui8InternalRssi = 0;
	g_sTrf7970Status.bNfcModeEnabled = false;
	g_sTrf7970Status.bProtocolError = false;

	GPIO::setExtField(g_sTrf7970Status.bRfFieldOn);

	// Reset Auto-SDD parameters
	g_ui8IdLength = 0x00;
	g_bNfcDepSupport = false;
	g_bIsoDepSuport = false;

	do {
		//
		// Soft Init Command
		//
		TRF797x_directCommand(TRF79X0_SOFT_INIT_CMD);

		//
		// Idle Command
		//
		TRF797x_directCommand(TRF79X0_IDLE_CMD);

		waitms(1);

		//
		// Register 09h. Modulator Control
		//
		TRF797x_readSingle(ui8RxBuffer, TRF79X0_MODULATOR_CONTROL_REG);

	} while (ui8RxBuffer[0] != 0x91 && ui8RetryCounter++ < 5);

	if (ui8RetryCounter == 0x05) {
		return STATUS_FAIL_T;
	}

	//
	// Register 00h. Chip Status Control
	//
	TRF797x_writeSingle(0x21, TRF79X0_CHIP_STATUS_CTRL_REG);

	//
	// Register 09h. Modulator Control
	//
	// SYS_CLK (in this case 13.56 MHz) out optional, based on system req.
	TRF797x_writeSingle(0x00, TRF79X0_MODULATOR_CONTROL_REG);

	//
	// Register 0Bh. Regulator Control
	//
	TRF797x_writeSingle(0x87, TRF79X0_REGULATOR_CONTROL_REG);

	//
	// Reset FIFO CMD + Dummy byte
	//
	TRF797x_resetFIFO();

	//
	// Register 00h. Chip Status Control
	//
	// +5 V operation
	TRF797x_writeSingle(0x00 | TRF79X0_CHIP_STATUS_CTRL_BYTE,
			TRF79X0_CHIP_STATUS_CTRL_REG);

	//
	// Register 0Dh. Interrupt Mask Register
	//
	TRF797x_writeSingle(0x3E, TRF79X0_IRQ_MASK_REG);

	//
	// Register 14h. FIFO IRQ Level
	//
	// RX High = 96 bytes , TX Low = 32 bytes
	TRF797x_writeSingle(0x0F, TRF79X0_FIFO_IRQ_LEVEL);

	TRF797x_readSingle(ui8RxBuffer, TRF79X0_IRQ_STATUS_REG);

	return OK;
}

/*
 * Initialize TRF7970A after the receipt of a SENS_REQ (Type A), SENSB_REQ (Type B), SENSF_REQ (Type F),
 * ATR_REQ @ 106 (Active Type A), ATR_REQ @ 212/424 (Active Type F). This function must be execute only when
 * the first command is received from the polling device.
 */
uint8_t TRF797x_targetInitialize(void) {
	uint8_t ui8Status = OK;
	t_sTRF797x_Bitrate sTargetBitrate;

	// Initialize Target Bitrate
	sTargetBitrate.ui16word = 0x0000;

	// Check if one the supported bitrates corresponds to the current bitrate.
	if ((g_sTargetSupportedBitrates.ui16word
			& g_sTrf7970Status.sTargetPayloadFrequency.ui16word) == 0) {
		ui8Status = STATUS_FAIL_T;
	} else if (g_sTrf7970Status.sTargetPayloadFrequency.bits.b106kpbs == 1) {
		// Check for SENS_REQ (Type A)
		if (g_sTrf7970Status.ui8FifoBytesReceived == 1
				&& (g_ui8FifoBuffer[0] == 0x26 || g_ui8FifoBuffer[0] == 0x52)) {
			if (g_sTargetSupportedTechnologies.bits.bPassiveTypeA == 1) {
				g_sTrf7970Status.sTargetMode.bits.bPassiveTypeA = 1;
			} else
				ui8Status = STATUS_FAIL_T;
		}
		// Check for SENSB_REQ (Type B) or
		else if ((g_sTrf7970Status.ui8FifoBytesReceived == 0x03
				&& g_ui8FifoBuffer[0] == 0x05)
				|| (g_sTrf7970Status.ui8FifoBytesReceived == 0x09
						&& g_ui8FifoBuffer[0] == 0x1D)
				|| (g_sTrf7970Status.ui8FifoBytesReceived == 0x01
						&& g_ui8FifoBuffer[0] == 0xC2)) {
			if (g_sTargetSupportedTechnologies.bits.bPassiveTypeB == 1) {
				g_sTrf7970Status.sTargetMode.bits.bPassiveTypeB = 1;

				sTargetBitrate.bits.b106kpbs = 1;
				TRF797x_switchTargetBaudRate(sTargetBitrate, true);

				// Register 09h. Modulator Control Register - ASK (10 %)
				TRF797x_writeSingle(TRF79X0_MOD_CTRL_MOD_ASK_10,
						TRF79X0_MODULATOR_CONTROL_REG);

//				TRF797x_writeSingle(0x03, TRF79X0_NFC_LOW_DETECTION_LEVEL);
			} else
				ui8Status = STATUS_FAIL_T;
		}
		// Check for ATR_REQ (Active Type A)
		else if (g_sTrf7970Status.ui8FifoBytesReceived
				== (g_ui8FifoBuffer[1] + 1)) {
			if (g_sTargetSupportedTechnologies.bits.bActiveTypeA == 1) {
				g_sTrf7970Status.sTargetMode.bits.bActiveTypeA = 1;
				TRF797x_switchTargetBaudRate(
						g_sTrf7970Status.sTargetPayloadFrequency, true);
			} else
				ui8Status = STATUS_FAIL_T;
		} else
			ui8Status = STATUS_FAIL_T;
	} else if (g_sTrf7970Status.sTargetPayloadFrequency.bits.b212kpbs == 1) {
		// Check for SENSF_REQ (Type F)
		if (g_sTrf7970Status.ui8FifoBytesReceived == 0x06
				&& g_ui8FifoBuffer[0] == 0x06) {
			if (g_sTargetSupportedTechnologies.bits.bPassiveTypeF == 1) {
				g_sTrf7970Status.sTargetMode.bits.bPassiveTypeF = 1;

				sTargetBitrate.bits.b212kpbs = 1;
				TRF797x_switchTargetBaudRate(sTargetBitrate, true);

				// Register 09h. Modulator Control Register - ASK (10 %)
				TRF797x_writeSingle(TRF79X0_MOD_CTRL_MOD_ASK_10,
						TRF79X0_MODULATOR_CONTROL_REG);
			} else
				ui8Status = STATUS_FAIL_T;
		}
		// Check for ATR_REQ (Active Type F)
		else if (g_sTrf7970Status.ui8FifoBytesReceived == g_ui8FifoBuffer[0]) {
			if (g_sTargetSupportedTechnologies.bits.bActiveTypeF == 1) {
				g_sTrf7970Status.sTargetMode.bits.bActiveTypeF = 1;
				TRF797x_switchTargetBaudRate(
						g_sTrf7970Status.sTargetPayloadFrequency, true);

				// Register 09h. Modulator Control Register - ASK (10 %)
				TRF797x_writeSingle(TRF79X0_MOD_CTRL_MOD_ASK_10,
						TRF79X0_MODULATOR_CONTROL_REG);
			} else
				ui8Status = STATUS_FAIL_T;
		} else
			ui8Status = STATUS_FAIL_T;
	} else if (g_sTrf7970Status.sTargetPayloadFrequency.bits.b424kpbs == 1) {
		// Check for SENSF_REQ (Type F)
		if (g_sTrf7970Status.ui8FifoBytesReceived == 0x06
				&& g_ui8FifoBuffer[0] == 0x06) {
			if (g_sTargetSupportedTechnologies.bits.bPassiveTypeF == 1) {
				g_sTrf7970Status.sTargetMode.bits.bPassiveTypeF = 1;

