filipesfreitas/Repo-Aulas-Micro/referencias_software_msp430/MSP430Ware_3_60_00_10/nfclink/nfclinklib/Source/RFID/RFID.cpp
				sTargetBitrate.bits.b424kpbs = 1;
				TRF797x_switchTargetBaudRate(sTargetBitrate, true);

				// Register 09h. Modulator Control Register - ASK (10 %)
				TRF797x_writeSingle(TRF79X0_MOD_CTRL_MOD_ASK_10,
						TRF79X0_MODULATOR_CONTROL_REG);
			} else
				ui8Status = STATUS_FAIL_T;
		}
		// Check for ATR_REQ (Active Type F)
		else if (g_sTrf7970Status.ui8FifoBytesReceived == g_ui8FifoBuffer[0]) {
			if (g_sTargetSupportedTechnologies.bits.bActiveTypeF == 1) {
				g_sTrf7970Status.sTargetMode.bits.bActiveTypeF = 1;
				TRF797x_switchTargetBaudRate(
						g_sTrf7970Status.sTargetPayloadFrequency, true);
			} else
				ui8Status = STATUS_FAIL_T;
		} else
			ui8Status = STATUS_FAIL_T;
	} else {
		ui8Status = STATUS_FAIL_T;
	}

	return ui8Status;
}

/*
 * Setup Target Mode and supported frequencies.
 */
uint8_t TRF797x_targetModeSetup(t_sTRF797x_TargetMode sSupportedModes,
		t_sTRF797x_Bitrate sTargetSupportedFrequency) {
	uint8_t ui8RxBuffer[2];

	// Reset Status Values
	g_sTrf7970Status.ui8FifoBytesReceived = 0x00;
	g_sTrf7970Status.bTxComplete = false;
//	g_sTrf7970Status.bTargetSelected = false;
	g_sTrf7970Status.bRfFieldOn = false;
	g_sTrf7970Status.eCurrentMode = TRF_TARGET_MODE;
	g_sTrf7970Status.sTargetPayloadFrequency.ui16word = 0x0000;
	g_sTrf7970Status.sTargetMode.ui8byte = 0x00;
	g_sTrf7970Status.sInitiatorPayloadFrequency.ui16word = 0x0000;
	g_sTrf7970Status.sInitiatorMode.ui8byte = 0x00;
	g_sTrf7970Status.eIrqFlags = IRQ_STATUS_IDLE;
	g_sTrf7970Status.ui8InternalRssi = 0;
	g_sTrf7970Status.bNfcModeEnabled = false;
	g_sTrf7970Status.bProtocolError = false;

	g_sTargetSupportedTechnologies = sSupportedModes;
	g_sTargetSupportedBitrates = sTargetSupportedFrequency;

	//
	// Soft Init. Command
	//
	TRF797x_directCommand(TRF79X0_SOFT_INIT_CMD);

	//
	// Idle Command
	//
	TRF797x_directCommand(TRF79X0_IDLE_CMD);

	//
	// Register 09h. Modulator Control Register - OOK (100 %) (This helps reduce the time to activate Type A)
	//
	TRF797x_writeSingle(TRF79X0_MOD_CTRL_MOD_OOK_100,
			TRF79X0_MODULATOR_CONTROL_REG);

	//
	// Register 00h. Chip Status Control
	//
	// RF output active
	TRF797x_writeSingle(
			TRF79X0_STATUS_CTRL_RF_ON | TRF79X0_CHIP_STATUS_CTRL_BYTE,
			TRF79X0_CHIP_STATUS_CTRL_REG);

	//
	// Register 01h. ISO Control Register
	//
	// Handle all incoming Technologies (A/B/F) and frequencies (106/212/424)
	TRF797x_writeSingle(0x21, TRF79X0_ISO_CONTROL_REG);

	//
	// Register 0Ah. RX Special Settings
	//
	TRF797x_writeSingle(0xF0, TRF79X0_RX_SPECIAL_SETTINGS_REG);

	//
	// Register 0Bh. Regulator Control
	//
	TRF797x_writeSingle(0x01, TRF79X0_REGULATOR_CONTROL_REG);

	//
	// Register 14h. FIFO IRQ Level
	//
	// RX High = 96 bytes , TX Low = 32 bytes
	TRF797x_writeSingle(0x0F, TRF79X0_FIFO_IRQ_LEVEL);

	//
	// Register 16h. NFC Low Detection Level
	//
	TRF797x_writeSingle(0x03, TRF79X0_NFC_LOW_DETECTION_LEVEL);

	//
	// Register 18h. NFC Target level
	//
	TRF797x_writeSingle(0x07, TRF79X0_NFC_TARGET_LEVEL_REG);

	//
	// Read IRQ Register
	//
	TRF797x_readCont(ui8RxBuffer, TRF79X0_IRQ_STATUS_REG, 2);

	//
	// Read Target NFC Protocol Register
	//
	TRF797x_readSingle(ui8RxBuffer, TRF79X0_NFC_TARGET_PROTOCOL_REG);

	if (ui8RxBuffer[0] & 0x80) {
		g_sTrf7970Status.bRfFieldOn = true;
	}
	GPIO::setExtField(g_sTrf7970Status.bRfFieldOn);

	// Setup AutoSdd Register
	TRF797x_initAutoSdd();

	//
	// Enable Decoder Command
	//
	TRF797x_directCommand(TRF79X0_RUN_DECODERS_CMD);

	return OK;
}

/*
 * Setup Initiator Mode and Initiator frequency.
 */
uint8_t TRF797x_initiatorModeSetup(t_sTRF797x_InitiatorMode sInitiatorMode,
		t_sTRF797x_Bitrate sFrequency) {

	// Reset Status Values
	g_sTrf7970Status.ui8FifoBytesReceived = 0x00;
	g_sTrf7970Status.bTxComplete = false;
	g_sTrf7970Status.bTargetSelected = false;
	g_sTrf7970Status.bRfFieldOn = false;
	g_sTrf7970Status.eCurrentMode = TRF_INITIATOR_MODE;
	g_sTrf7970Status.sTargetPayloadFrequency.ui16word = 0x0000;
	g_sTrf7970Status.sTargetMode.ui8byte = 0x00;
	g_sTrf7970Status.sInitiatorPayloadFrequency = sFrequency;
	g_sTrf7970Status.sInitiatorMode = sInitiatorMode;
	g_sTrf7970Status.eIrqFlags = IRQ_STATUS_IDLE;
	g_sTrf7970Status.ui8InternalRssi = 0;
	g_sTrf7970Status.bNfcModeEnabled = false;
	g_sTrf7970Status.bProtocolError = false;

	TRF797x_switchInitiatorBaudRate(sFrequency, true);

	return OK;
}

#pragma vector = PORT2_VECTOR
__interrupt void TRF797x_IRQ_ISR(void) // interrupt handler
		{
	IRQ_REQ_REG &= ~IRQ_PIN;

	if (g_sTrf7970Status.eCurrentMode == TRF_TARGET_MODE) {
		if (g_sTrf7970Status.bTargetSelected == true) {
			g_ui8IrqFlag = 0x01;
			return;
		} else {
			TRF797x_irqHandler(0);
		}
//		if (TRF797x_irqHandler(0) == IRQ_STATUS_RX_COMPLETE) {
//			RF_anticollisionProcess(g_ui8FifoBuffer, g_sTrf7970Status.ui8FifoBytesReceived);
//		}
	} else {
		g_ui8IrqFlag = 0x01;
	}
}
